[
    {
        "name": "Ningbo APS Electronics Technology Co.,Ltd",
        "email": "jack@apschina.cn",
        "phone": "+86 574 86501817",
        "website": "http://www.apschina.cn/",
        "location": "China",
        "address": "No. 192, crab pool Temple Road, Zhenhai, Ningbo, Zhejiang，China",
        "about_us": "NINGBO APS ELECTRONICS TECHNOLOGY CO.,LTD was established in May,2009 by several professionals who commit to the industry for many years. As a professional manufacturer,NINGBO APS specialized in research,development,production and marketing in the field of computer peripheral cables and adapters.We have many experienced R&D engineers,high efficiency production,modernized workshop as well as advanced manufacturing equipment to guarantee the highest quality.\nWe supply a wide range of cables,including Lan Cables(Cat5/5e/6/6a/7)、Patch Cables(Cat5/5e/6/6a/7)、USB Cables、HDMI Cables、RCA Cables、VGA Cables、Telephone cables and relative Adapters,etc.Due to our dedicated focus on technology、new products development、honesty sales in the past years,NINGBO APS has grown as an experienced and modernized communication cables supplier.With the high quality and competitive price,most of our cables are exported to the industrialized country of Europe and America . Persisted in the principle of \"Excellent quality,Preferable price,Considerate services\",NINGBO APS is devoted to provide our customer best price and service."
    },
    {
        "name": "Shanghai Xianrui Industry and Trade Co., LTD",
        "email": "sales@sh-fanxian.com",
        "phone": "+8618602107681",
        "website": "http://www.sh-fanxian.com/",
        "location": "China",
        "address": "NO 8,YUANSHUN ROAD,PUDONG NEW AREA, Shanghai,China",
        "about_us": "Our company specializes in the manufacture and sales of marine diesel engine spare parts.\n\nBusiness scope: professional supply of marine diesel engine spare parts\n\nTechnical personnel: there are four existing technicians and 16 technical workers, who are respectively responsible for process production, quality inspection and procurement of two-stroke diesel engine and four stroke diesel engine. All core technicians have more than 10 years of working experience in the industry.\n\nInventory and location advantages: the company is located in Nanhui Industrial Park, Pudong New Area, Shanghai, close to Pudong Airport, Yangshan Port and Waigaoqiao. It can quickly arrange the warehousing and shipment of goods within 30 minutes.\n\nEquipment advantages: the company has a processing center and several large sleeping cars, which can undertake new parts of core components such as piston head, exhaust valve stem and valve seat.\n\nAdvantages of sales department: the company has sales personnel in Dalian and Shanghai, and is equipped with professional English sales personnel, who can communicate with crew and maintenance in fluent English."
    },
    {
        "name": "CAMELOT Marine China CO.,Limited",
        "email": "info@camelotcn.com",
        "phone": "+86-21-68971108",
        "website": "http://camelotcn.com/en/",
        "location": "China",
        "address": "No. 258 Upriver, Lane 193, Nanlu Road, Pudong New Area, Shanghai, P.R. China, 201314",
        "about_us": "Spare parts for engine and turbocharger,purifier,compressor,air conditioner,boiler,deck mechine and so on…ship store for engine room and deck ,electrical, carbin and safety , mooring rope.lashing unlashing parts.\n\nNew building equipment:heat exchanger,purifier,fuel oil supply unit,air conditioner… according agent certification from maker.\n\nRepair and port service: urgent repair include main engine,shaft seal change,hydrolic mechine repair,main cooler repair,turbocharger repair and balance adjust,main switch change,and so on.\n\nAs broker of buy vessel,and design of all kind \n\nvessel.bulk,tank,container and so on. \n\nOur motto:best service is based on best quality"
    },
    {
        "name": "SUNRISE MARINE SERVICE & TRADING LTD.",
        "email": "info@smst-cn.com",
        "phone": "+86-22-60262654",
        "website": "https://www.smst-cn.com/",
        "location": "China",
        "address": "No.138, Jintang Road, Hedong District, Tianjin, China",
        "about_us": "SMST Ltd. is a comprehensive trading company, headquartered in Hong Kong with representative office in Tianjin. SMST specializes in providing comprehensive marine service in Stores Supply, Provisions & Bonded Stores Supply, Spare Parts Supply & Export to all kinds of merchant vessels.\n\n \n\nMeanwhile, SMST has been committed to sourcing, designing, distributing and exporting of flatware, ceramic ware and home ware. We have the long partner factory for all kinds of products to ensure timely delivery with international quality standards and high-class service. In the past several years, hundreds of product series have been shipping to North America, South America and Europe market."
    },
    {
        "name": "Nanjing High Accurate Marine Equipment Co.,Ltd",
        "email": "mail@ngc-marine.com",
        "phone": " +86-025-52706932",
        "website": "http://www.ngc-marine.com/",
        "location": "China",
        "address": "No.1 Baoding Road,Science garden,Jiangning,211103,Nanjing,China",
        "about_us": "Nanjing High Accurate Marine Equipment Co., Ltd. (NGC Marine) was autonomized from NGC Group for both commercial and military marine business in 2007, inherits more than 50 year's experience in the development of transmission equipment. Being an innovated high-tech company with full qualification for commercial and military businesses, the company supplies varieties of key transmission and propulsion equipment for global high-tech vessels and offshore platform including controllable pitch propeller, azimuth thruster, NEpod thruster, tunnel thruster, main/auxiliary marine gearbox, port crane and conveyor gearbox, high speed gearbox, marine shafting and rudder system components and jack-up platform systems and etc. Thanks to years of technology introduction and innovation, the company owns several product series with self-owned intellectual property rights. Hundreds of world first class machining equipment is installed in the total area of 160,000m2 company spaces; and an annual capacity of over 1,000 sets of marine thruster and gearbox could be achieved. NGC Marine has established a complete quality system, and has been certificated by ISO9001 quality management system, ISO14001 environmental management system, OHSAS18000 occupational health & safety management system, and Military Standard System.NGC Marine owns more than 100 patents, and has won more than 40 provincial/ministerial and municipal science and technology awards. Our marine products are successfully applied to The Pillars of a Great Power, e.g. dredgers \"TIAN KUN HAO\"and \"HAO LONG HAO\" wind mill fixing vessel \"FENG HE HAO\", immersed tube carrier \"JIN AN HAO\", the technical specification and market share of azimuth thruster and main products rank No.1 in domestic market. Our products used for more than 1,000 vessels have been exported through global sales and after-sales network, the quality reaches international standard and highly recognized by customers and partners. NGC Marine is graded as national special precise unique innovative \"Little Giant\" Enterprise in 2021.\nThe company's operating principle is \"develop domestic and overseas business in parallel, promote domestic market via overseas business, win through high quality\", build the brand image through excellent quality, superior service and continuous innovation, aim to build international first-class transmission and propulsion equipment company, devote to provide customers around the world the best solution for all kinds of transmission and propulsion systems."
    },
    {
        "name": "Weifang Fuyuan Turbochargers Co., Ltd.",
        "email": "fuyuan@fuyuan.net.cn | kefu@fuyuan.net.cn | guanlibu@fuyuan.net.cn | bj@fuyuan.net.cn",
        "phone": "+86-0536-7616666",
        "website": "fuyuan.net.cn",
        "location": "China",
        "address": "No.56, Fengshan Road, Fangzi Dist,. Weifang City, Shandong Province，China",
        "about_us": "Weirang FuYuan Turbochargers Co., Ltd., founded in 1972, is a high-tech enterprise approved by Chinese government. W total assets of 350 million Yuan, the company has become one of the strongest comprehensive turbocharger suppliers in China.\n\nFuYuan is the only domestic turbocharger manufacturer that is able to provide multi-purpose, full range of turbocharging products. Product matching power ranges from 50KW to 4600KW, which can be widely used for passenger cars, commercial vehicles, engineering machineries, ships and gen sets. lt can be classified into gasoline engine, diesel engine, gas engine turbocharger according to the fuel used.\n\nThe newly developed SH series turbocharger performance has reached the international advanced technology level. T project Key Technology and Engineering Application of Full Load High Pressure Combustion won the second prize of national scientific and technological progress in 2013, breaking the technology monopoly of foreign companies in high pressure turbocharger area.\n\nDuring recent years, with the advanced technology center and first-class turbocharger test center in China, FuYuan has been constantly committing to technology progress of turbocharger products. FuYuan owns a full process production line of casting mold development, spare parts machining and product assembly to ensure the quality of products and technology advancement\n\nFuYuan is among the first to get ISO9001 and TS16949 quality management system certification. With sales and service centers in many provinces in China, we can ensure in-time products sales and service, eliminating customer's concern.\n\nLeveraging on the advanced technology, strong capability and high quality, FuYuan aims to develop into an advance turbocharger manufacturer in the world."
    },
    {
        "name": "TaiXing Expansion Marine Equipment Co., Ltd.",
        "email": "txeme@163.com | davidh-expansion@outlook.com ",
        "phone": "+86-523-80737090",
        "website": "http://www.txeme.com",
        "location": "China",
        "address": "East Industrial Zone of Taixing City, Jiangsu Province,225400, China",
        "about_us": "TaiXing Expansion Marine Equipment Co., Ltd., (EME,stock number:691692), has extensive knowledge and expertise in designing and manufacturing deck machineries like towing winch, mooring winch, anchor windlass, capstan etc for barge, container vessel, tug, MPV, oil tanker, scientific exploration ship, the Navy vessels, and associated deck equipment as bollards, warping rollers, chocks, fairleads, anchors and chains . For every single type and size of vessel, EME provides deck plans for efficient and effective anchoring and mooring operations. \n    EME designs light weight but strong winches and other products with compact structure,  which are easy adaptable to specific needs and requirements and user friendly, reliable, sustainable and needs low maintenance only. EME uses advanced full-automatic CNC cutting machine for precise layout cutting, and purchases high grade raw materials and first class components from manufacturers with a worldwide service network.\n    EME currently has over 100 staff, 18 of them professional engineers specialized in designing and developing electric or hydraulic windlass with chain diameter less than 114mm (M3), electric/hydraulic towing winches, mooring winch, positioning winch, capstan with SWL less than 3500KN, special winch like cable winch, hose winch, high speed winch etc and all kind of deck fittings. EME has exported product to USA, UK, Holland, Romania, Brazil, Australia, Russia, Korea, Singapore, India, Greece, Malaysia, USA, India, Vietnam, Seychelles etc, and is awarded ISO9001:2008 management system certificate, DNV, GL, LR, ABS, BV, RS, IRS, and other relevant certificates by now.\n    EME covers an area of over 20,000㎡, with plant area over 6,000㎡, office and supporting facilities area over 4,000㎡. EME sets up mechanical laboratory and testing platform to conduct mechanical tests, at maximum, 350T dynamic load test and 800T static load test, to guarantee the materials meet designing requirements. \n    EME endeavors to provide best quality products and untiring service for customer satisfaction. EME is always abiding by \"credibility, cooperation, mutual benefit and win-win\" principle to make sincere cooperation with our friends in and abroad for a better future. "
    },
    {
        "name": "NUVERTI HOLDINGS LTD.",
        "email": "info@nuverti.com",
        "phone": "+357 22005125",
        "website": "www.nuverti.com",
        "location": "Cyprus",
        "address": "Foti Pitta 8, Nicosia, Cyprus, 1065",
        "about_us": "NUVERTI HOLDINGS LTD., is a Trading House established in Cyprus. Specializing in the Shipping Industry, we can provide to your vessels' engines spare parts, technical support & repair services of high quality."
    },
    {
        "name": "Euploia Drydocks & Services Ltd ",
        "email": "admin@euploia.eu drydocks@euploia.eu spares@euploia.eu",
        "phone": " +30 210 9400660",
        "website": "www.euploia.eu",
        "location": "Greece",
        "address": "18 Poseidonos Avenue,\n176 74 Kallithea,\nGreece",
        "about_us": "Euploia Drydocks & Services Ltd is a well-established company of highly experienced and qualified managers in the Marine Services, specialising in Ship Repairs and Conversions.\n\nOur Core Business is to provide Dry and Afloat Repair Services as well as underwater services through our Worldwide Network of Leading Shipyards, Workshops, and Co-operating Companies.\n\nOur Products and Services Portfolio extends to the field of Marine Equipment, Spare Parts, Ballast Water Treatment System, Scrubber System, Lubricants, Bunker, Safety Products & Services.\n\nOur Mission is to meet and exceed our customer’s expectations by providing Products & Services of the highest standards in local and worldwide markets, accompanied with timely deliveries and competitive prices, honoring always our contractual commitments."
    },
    {
        "name": "Alpha Marine Engineering SA",
        "email": "info@ame.gr | service@ame.gr",
        "phone": "+30 210 89 43 220",
        "website": "www.ame.gr",
        "location": "Greece",
        "address": "49, Grigoriou Lambraki Av.\n16675 Glyfada\nAthens - Greece",
        "about_us": "The company was and is focused to serve the Greek Merchant Marine, Hellenic Navy and the Petroleum Industry in the best possible way by providing accurate and fast services / information related to the represented by Alpha Marine Engineering manufacturers only.\n\nServices provided to both Principals and Greek customer, are related to:\n\nNew building projects all over the world\nSupply of replacement equipment on existing ships\nSupply of retrofit equipment on existing ships\nSupply of spare parts, for our Principals range only\nMaintenance and service of Vapor Recovery Units.\nService/inspection/calibration/certification of KSB Seil VRC & O.D.M.E. SS-2000, S-3000, S663 MKIII\nService /inspection of TEAMTEC Incinerators\nService for  Brunvoll thrusters.\nCalibration/certification of pressure & temperature calibrators.\nUTI Calibration/certification\nVGP Sample collection, filed tests & effluent Analysis\nSpare parts and equipment supplied though A.M.E. are always genuine manufactured and guaranteed by the maker as:\n\nOffer submitted by A.M.E. is the same as if requested from manufacturer.\nOrder items are always supplied from makers’ factory.\nFinal invoice is issued by the maker and invoice is settled directly to the makers account (not A.M.E.).\nBy applying above procedure customers are always sure that the spares ordered will be the cheapest genuine spares available in the market and will ensure trouble free operation of the unit.\n\nIn order A.M.E. to be able to provide best possible service, A.M.E. has developed, and is continuously upgrading, its own in house software allowing all incoming and outgoing message to be filed / stored as a separate case file and traced either as a part of a customer or maker file or separately."
    },
    {
        "name": "CIRCOR International, Inc.",
        "email": "products@circor.com products@circor.com",
        "phone": "+1 781-270-1200",
        "website": "www.circor.com",
        "location": "United States",
        "address": "CIRCOR Corporate Headquarters\n30 Corporate Drive\nSuite 200 Burlington, MA 01803 United States",
        "about_us": "CIRCOR International is one of the world’s leading providers of mission critical flow control products and services for the Industrial and Aerospace & Defense markets. The Company has a product portfolio of market-leading brands serving its customers’ most demanding applications. CIRCOR markets its solutions directly and through various sales partners to more than 14,000 customers in approximately 100 countries. The Company has a global presence with approximately 3,100 employees and is headquartered in Burlington, Massachusetts. For more information, visit the Company’s website at http://circor.com.\n\nExcellence applied\nMany of our product brands have been around for more than a century, earning a reputation for trust and confidence among the customers we serve. To achieve and maintain this operational excellence, we focus on talent and continuous improvement along with the CIRCOR Operating System. The hallmarks of this program include results-driven leadership, Lean and process controls for efficiency, quality, higher performance, and safety.\n\nOur primary objective is to enhance shareholder value, expanding our capabilities through profitable growth, organically and through strategic acquisitions. With the evolution of our global infrastructure, we are continually committed to meeting the needs of our customers, our markets, and our peers."
    },
    {
        "name": "Technoservice",
        "email": "Technical@technoservice.gr Spares@technoservice.gr  Accounting@technoservice.gr  ",
        "phone": "0030 210 46 21 310",
        "website": "www.technoservice.gr",
        "location": "Greece",
        "address": "73 Methonis St. 185 45, Pireaus Athens",
        "about_us": "Technoservice has been established in 1972 in Piraeus, and is a well known marine manufacturing company in Greece.\n\nIts production line is flexible and highly capable to handle the demands of an ever-increasing shipping environment. It consists of both manual and CNC machines, which, combined with our long-term experience and excellent engineering expertise have long been accredited with the ISO9001 Quality Standard qualification."
    },
    {
        "name": "MARCO PUMPS",
        "email": "sales@marcopumps.gr",
        "phone": "210 4830329 (8 lines)",
        "website": "www.marcopumps.gr",
        "location": "Greece",
        "address": "Ave. Athens - Piraeus 97\n185 41 Piraeus",
        "about_us": "The MARCO PUMPS specializes in the handling of liquids. Represents and introduce products branded manufacturer with a leading position in the market and manufactures Fire fighting, booster sets and Pump Assemblies, first introduced in the Greek market.\n\nThe company is headquartered in Piraeus ,in a private area to 3,100 sq.m. and also has a store 700 sq.m.in Thessaloniki, greece.\n\nThe MARCO PUMPS features :\n\na full programme of pumps for every application. Solutions for housing ,Tourist facilities,Infrastructure, Industry, Agricultural Production and Shipping.\nAfter sales support throughout the country (after sales service)\nStaff are of a high technical and scientific expertise.\nCertification ISO 9001:2015"
    },
    {
        "name": "Daka Sealing Systems",
        "email": "sales@daka-seals.gr",
        "phone": "+30210 4110947, +30210 41 10984, +30210 41 29831",
        "website": "www.daka-seals.gr",
        "location": "Greece",
        "address": "Kastoros 4, Piraeus\n18540, ATTICA",
        "about_us": "Our company established in 1984, operates and specializes in the field of sealing systems and applications. We have been cooperating with the biggest and most recognized manufactures worldwide especially in Europe and Asia. Our company provides a very large stock in HYDRAULICS SEALS, MECHANICAL SEALS, O-RINGS, SEAT RINGS, OIL SEALS and more. All of our spare parts we can supply to you are high quality replacement spare parts in very competitive prices.\n\nWe can guarantee you excellent operation of our products and of course of our sales department combined with the experience of so many years in that field, can help you any time of any sealing problem you have. Furthermore, we deliver worldwide, since we have been cooperating with the most reliable forwarders. To sum up, our target is the satisfaction of our clients, combined with quality, reasonable prices and on time delivery. Please do not hesitate to contact us for further information. Any time at your disposal."
    },
    {
        "name": "MarFlex Europe BV",
        "email": "info@marflex.com",
        "phone": "+31 (0)186 890 200",
        "website": "www.marflex.com",
        "location": " Netherlands",
        "address": "Louis Pasteurstraat 8\n3261 LZ Oud-Beijerland\nThe Netherlands",
        "about_us": "MarFlex is an electric drive pumping solutions manufacturer for maritime, offshore, and industrial markets; our pumps are currently installed on inland and sea-going ships, as well as at offshore platforms and tank storage. Our strength is providing a complete electric pumping solution to our customers consisting of electric motor-driven pumps and frequency converter drives (Variable Speed Drive System, VSDS) with an optional remote access feature. The use of VSDS allows complete speed control of the deck-mounted electric motor-driven pump, contributing to deck chatter reduction. The system is designed and built in-house in our factory in the Netherlands. Our pumps make a complete pumping solution best suited to your needs, combined with control panels manufactured by our sister company\n\nOur electric-driven pump solutions are efficient, sustainable, coming with smart protection software with extensive engineering calculations, and operate at a low noise of 75-83 dB at under 2 meters, reducing ocean noise pollution.\n\nOur Objectives\nContinue to make our Electric-Driven Deepwell Pump systems to be the global market standard.\nCraft an organizational culture where people can thrive in their ambitions and generate an attitude that focuses on the customer’s experience and expectations.\nSustainable environment through the proper due diligence practiced and recognized utilizing the triple bottom line approach.\nMember of Taiko Group\nAfter over 20 years of cooperation, Marflex has become a member of Taiko Holdings – the event that highlights trust we have developed with our partners.\n\nWe believe that this will create the synergy that benefits our company and all members of Taiko Holdings, and our broad range of customers.\n\n"
    },
    {
        "name": "Mondial Ship Services",
        "email": "sales@mondialshipservices.com",
        "phone": " +30 210 42.91434,  +30 210 4291433",
        "website": "www.mondial-technics.com",
        "location": "Greece",
        "address": " 11 Mavrokordatou Str., Piraeus, Greece",
        "about_us": "“Mondial Ship Services” is a well-established spare parts trading company since 1990, based in Piraeus, providing services and technical consultancy to its distinguished clients. Over the years, we have built solid and strong relationships with a number of reputable clients offering premium services worldwide."
    },
    {
        "name": "Morfi Hydraulics ",
        "email": "info@morfi-hydraulics.gr",
        "phone": "+30 210 40 21 670",
        "website": "www.morfi-hydraulics.gr",
        "location": "Greece",
        "address": "5 Ilias st, Perama, 188 63, Piraeus, Greece",
        "about_us": "Our company has a hydraulic test bench with digital display of all information where it comes from the components we test and work with PLC operating system.\n\nWe cover a wide range of tests on hydraulic pumps and motors, cylinders and controls and we have a wide range of new and repaired in stock of our company."
    },
    {
        "name": "Bosung Engineering CO.,LTD.",
        "email": "master@bosung.com",
        "phone": "+(82) 51-466-0881~4",
        "website": "www.bosung.com",
        "location": " Korea",
        "address": "6, Jungang-daero 260 Beon-gil, Dong-gu, Busan, Korea",
        "about_us": "Bosung Engineering Co.,Ltd. was established in 1982 and has been successfully developed as one of World’s leading supplier in the field of ship’s spare parts and marine machinery equipments for more than 30 years.\nIn 1997 Bosung obtained the ISO9001 & ISO14001 certificate from DNV to comply with international standards and customer’s complete satisfaction.\n\nWe have established European Branch in Hamburg in 2005, Local office in Athens in 2007 and Representative Office in Singapore in 2010 to facilitate the communication processes with worldwide customers and to make immediate services throughout the world.\n\nOur Policy is to put the client first by delivering top quality parts and materials at the Best Speed, Best Price and Best Quality.\n\nWith utmost efforts we have made and will make to our best customers, we promise to keep and develop good business relationships continuously."
    },
    {
        "name": "GEA Greece",
        "email": "",
        "phone": "+30 210 60 34 384",
        "website": "www.gea.com/en",
        "location": "Greece",
        "address": "Parodos Leontariou, Palini, Attika, Greece, 15351",
        "about_us": "GEA is one of the world’s largest systems suppliers for the food, beverage and pharmaceutical sectors. Our portfolio includes machinery and plants as well as advanced process technology, components and comprehensive services. Used across diverse industries, they enhance the sustainability and efficiency of production processes globally."
    },
    {
        "name": "Dragflow S.r.l.",
        "email": "info@dragflow.it\n",
        "phone": "+ 39 0376 1685 400",
        "website": "dragflowpumps.com",
        "location": "Italy",
        "address": "Via Paesa\n46048 Roverbella MN, Italy",
        "about_us": "Dragflow company started in the ’80 as a manufacturer of heavy duty submersible pumps. Today we are globally known for being one of the pumps and dredging systems producers more committed to technological innovation. Many successful projects and customer satisfaction have encouraged us to continue with the research and further development of our products.\n\nOur goal? Provide customized solutions to deal with even the most complex challenges with the right equipment."
    },
    {
        "name": "ITT Bornemann",
        "email": "info.bornemann@itt.com",
        "phone": "+49 5724 390-0",
        "website": "www.bornemann.com/",
        "location": "Germany",
        "address": "ITT Bornemann GmbH\nIndustriestrasse 2\n31683 Obernkirchen Germany",
        "about_us": "ITT Bornemann from Obernkirchen, Germany, has a long history of success as shown in Bornemann's timeline. Since the company was founded in 1853, our goal has been to respond to markets with products and solutions that are technologically outstanding and cost-effective. From that point on, Bornemann has been setting the pace. In 1934, for example, it patented the Twin-Screw Pump with external bearings. In the 1960s, the development of the triple-screw pump and the Progressive Cavity Pump led to more innovative solutions, and in the 1980s, Bornemann's multiphase pumps created commercial opportunities that had been previously unthinkable. Our manufacturing focus nowadays focuses on the twin-screw pumps.\n\nA superior command of technology in nearly all areas of application has made Bornemann a worldwide leader in its field. Sales offices and subsidiaries worldwide ensure that there is immediate and professional support throughout all phases of the production process ranging from detailed advice extending to tailor-made engineering and finally including reliable maintenance of the installed pumps and systems. Efficiency, reliability and a high level of availability are the most important features that distinguish Bornemann pumps and systems."
    },
    {
        "name": "Gemmecotti European Pumps",
        "email": "info@gemmecotti.com\n ",
        "phone": "+39 02 96460406",
        "website": "www.gemmecotti.com",
        "location": "Italy",
        "address": "Via Po 23-25-27\n20031 Cesate MI  Italy",
        "about_us": "GemmeCotti srl has been designing and manufacturing chemical pumps for acids and dangerous liquids since 1992, when its founders started their own company after considerable experience in pump design and production.\nOver the years, GemmeCotti has created its own range of industrial pumps designed and manufactured by its experienced team of experts. We are now specialized in magnetic drive pumps, mechanical seal pumps and vertical pumps.\nThe company is characterized by the high quality of its pumps, which is guaranteed by the use of materials of Italian origin and by the constant care of qualified and always up-to-date personnel, who pays special attention to the customer’s needs and offers assistance during the whole purchasing process.\n\nOur wide range of products includes magnetic drive centrifugal pumps, mag-drive turbine pumps, mag-drive vane pumps, vertical pumps, mechanical seal pumps and manufactured in thermoplastic materials (PP or PVDF) or metallic materials (AISI 316). All GemmeCotti pumps are in compliance with the Machinery Directive (CE/2006/42).\nGemmeCotti pumps are valued worldwide and they are successfully used in many different industries including: chemical and petrochemical, pharmaceutical, oil refinery, electroplating, printed circuits, electronic, photography, military, water treatments, biotechnology, paper mills, textile, sugar plants, food processing, dairies and many others."
    },
    {
        "name": "KSB SE & Co. KGaA",
        "email": "info@ksb.com",
        "phone": "+49 6233 86-0",
        "website": "www.ksb.com",
        "location": "Germany",
        "address": "Johann-Klein-Str. 9\n67227 Frankenthal, Germany",
        "about_us": "KSB SE & Co. KGaA is a German multinational manufacturer of pumps, valves with headquarters in Frankenthal (Pfalz), Germany. The KSB Group has manufacturing plants, sales and marketing organizations, and service operations on every continent except Antarctica."
    },
    {
        "name": "DESMI Danmark A/S",
        "email": "desmi@desmi.com",
        "phone": "+45 9632 8111",
        "website": "www.desmi.com",
        "location": "Denmark",
        "address": "Tagholm 1\nDK-9400 Nørresundby\nDenmark",
        "about_us": "DESMI specializes in the development, manufacturing, sale and service of pumps and pumping solutions including a wide range of environmental equipment for oil spill, seaweed and clean waterways. \n\nDESMI was founded in 1834 and is one of Denmark’s oldest companies and today these solutions are sold to more than 150 countries via a network of subsidiaries and distributors on six continents."
    },
    {
        "name": "Naniwa Pump Mfg. Co., Ltd.",
        "email": "info@naniwa-pump.co.jp",
        "phone": "+81(0)6-6541-6231",
        "website": "www.naniwa-pump.co.jp",
        "location": "Japan",
        "address": "11-5. Shinmachi 3-chome, Nishi-ku,\nOsaka 550-0013, Japan",
        "about_us": "Manufacturers of pumps. Naniwa Pump Mfg. Co., Ltd. is aiming to provide the world's best quality and service in the field of Marine Engine Room Pumps"
    },
    {
        "name": "HEISHIN Ltd",
        "email": "",
        "phone": "+81-3-5204-6380",
        "website": "www.mohno-pump.co.jp",
        "location": "Japan",
        "address": "Nihombashi Kato Bldg. 8F, 2-1-14, Nihombashi, Chuoh-ku, Tokyo 103-0027 Japan",
        "about_us": "Mohno Pumps provide non-pulsating conveyance of various fluids.\nLearn all about Mohno Pumps, from construction to the unique characteristics."
    },
    {
        "name": "Pumpseal Sales Pty Ltd",
        "email": "sales@pumpseal.com.au",
        "phone": " +61 2 9620 6444",
        "website": "www.pumpseal.com.au",
        "location": "Australia",
        "address": "21 Prince William Drive\nSeven Hills NSW 2147\n",
        "about_us": "For over forty years Pumpseal Sales has been providing specialised personal customer service, designed to be responsive to the client’s requirements and flexible enough to adapt to or adopt emerging markets and new technologies.\n\nThe cornerstone of our success has been based upon consistently delivering a superior level of technical expertise and aligning ourselves with quality products as the exclusive agent for many industry-leading local and international manufacturers.\n\nThrough experience and the careful selection of quality products, we have built up a highly regarded reputation in the industrial market place as a supplier of pumps, allied equipment and ancillary services in Australia, the Pacific Islands and South-East Asia. We service supply and repair contracts for some of Australia’s best-known companies and Government Utilities.\n\nWe make a loyal commitment to support our customers with highly capable technical sales staff. We are able to consult and advise at any stage of a project including specification, selection, tendering, commissioning, through to after-sales service, spare parts and repair in our workshop. Our technical sales staff as well as workshop and stores personnel are carefully selected for their knowledge and experience and have been fully trained in all our products.\n\nOur management team is continually looking over the horizon for market applications and opportunities, to ensure we continue to deliver the best product at the best competitive price to our customers."
    },
    {
        "name": "Overseas Motors (Pte) Ltd",
        "email": "sales@oseamo.com",
        "phone": "+ 65 6264 7288",
        "website": "www.oseamo.com",
        "location": "Singapore",
        "address": "19 Fourth Chin Bee Road,\nSingapore 619705",
        "about_us": "Overseas Motors Group was established in 1956 and is Singapore’s preferred industrial partner for pumps, high pressure products and agricultural equipment. We are the authorised distributor and service center for world-famous pumps and agricultural equipment.\n\nOur Products: Our range of pumps include Centrifugal Pumps, Diaphragm Pumps, Magnetic Drive Pumps Plunger Pumps, Drum Pumps, Submersible Pumps and other specialised Pumps. For agricultural products, we distribute STIGA Garden Equipment, Tanaka Brush Cutters, Mitsuibishi Generators, Kranzle High Pressure Cleaners, MTD Lawn Mowers and others."
    },
    {
        "name": "Lavastica International B.V.",
        "email": "info@lavastica.com, sales@lavastica.com",
        "phone": "+31 (0)10 - 265 50 70",
        "website": "www.lavastica.nl",
        "location": "Netherlands",
        "address": "Vareseweg 45\n3047 AT Rotterdam\nThe Netherlands",
        "about_us": "Lavastica International has been a supplier of technical systems and spare parts to the maritime, offshore and industrial markets since 1998. We can also offer high qualified technical support and repair for your installations. In our warehouse we keep a large stock of complete systems and spare parts including reconditioned equipment. Thanks to our global network, Lavastica can supply components and arrange technical assistance worldwide within a short period of time.\n\nLavastica specializes in replacements for obsolete products helping to extend the lifetime of your technical installations. We produce and engineer custom-made equipment to your specification as well. In addition, Lavastica has the expertise for refits and new building projects for all kinds of vessels, offshore and industrial installations. Doing business with Lavastica will save you time and ensure that your installation is continually running in the most effective way.\n\nLavastica International is certified ISO 9001 by Lloyd’s Register.\n"
    },
    {
        "name": "Drakos Polemis",
        "email": "sales@dppumpsgroup.com",
        "phone": "+ 30 210 8161 402",
        "website": "dppumps.global",
        "location": "GREECE",
        "address": "16 KOLOKOTRONI St, KRYONERI, ATTICA, GREECE",
        "about_us": "DP PUMPS Group is a leading pump manufacturing company in Greece and South East Europe\nregion. Our company possesses the accumulated on - hands experience of almost seven decades in the pumps construction field, focused on projects for power plants, infrastructure and\nseveral more demanding markets, worldwide.\nWith the latest addition of AVERSA within our group of companies (the leading pump manufacturer of Romania with 135 years of history), we have expanded our product range including horizontal heavy-duty pumps for the oil & gas industry following API 610 standards."
    },
    {
        "name": "ABC MARINE SERVICE LTD",
        "email": "Email: abc@abcmarine.gr",
        "phone": "+30 210 4227 190,  +30 210 4227 140",
        "website": "abcmarine.gr",
        "location": "GREECE",
        "address": "ABC MARINE SERVICE LTD\n100 KOLOKOTRONI STREET,\n18535 PIRAEUS, GREECE",
        "about_us": "ABC Marine was founded in 2005 by experts in various Marine and Marketing fields aiming to always offering Highest Quality Parts & Services on a fast and reliable basis to the Greek Shipping Community.\n\nABC Marine cooperates as an Exclusive Agent with well-known Makers and Trading Firms around the world. All parts and services are duly Warranted and Invoiced by our Principals."
    },
    {
        "name": "Alson S.A",
        "email": "info@alson.gr",
        "phone": "+30 210 2855878",
        "website": "www.alson.gr",
        "location": "Greece",
        "address": "12th klm National Road Athens-Lamia, Metamorfosi 14452 Attica,Greece",
        "about_us": "The ALSON S. a. is the oldest Greek company that imports and distributes special pumps positive displacement (lobe, progressive cavity, etc.) in the Greek market. Thanks to the extensive experience of its human resources and the continuous development of cooperation with leading manufacturing companies in the world, the ALSON has been established in the Greek market for the quality of the equipment supplied and the technical support it provides."
    },
    {
        "name": "Argyriou S.A.",
        "email": "info@argyriousa.gr",
        "phone": "+30 210 491 6601",
        "website": "www.argyriousa.gr",
        "location": "Greece",
        "address": "Riga Fereou 16, Nea Chalkidona 143 43, Greece",
        "about_us": "The company SILVER with years of experience in the field of security systems and fire safety, provides Security Systems, Fire detection Systems, fire Extinguishing system, Seminars, Fire safety & Services for Scholars."
    },
    {
        "name": "Turbotec - Pistolis Ltd",
        "email": " info@turbotec.gr | sales@turbotec.gr",
        "phone": "+30 210 441 5963, +30 210 402 2794",
        "website": "www.turbotec-pistolis.com",
        "location": "Greece",
        "address": "123 Dimokratias Ave., 188 63 Perama, Greece",
        "about_us": " Since 1980, we have been and still remain one of the TRUSTWORTHINESS FIRMS, in the field of TURBOCHARGERS and MARINE TECHNOLOGY.\nOur years in operation, proof of our experience.\n\nOur company's overall philosophy lies in providing products of the highest quality, along with specialized services, both to greek and international customers.\n\nLocated in our modern, six-story building, with stock, ready to deliver, spare of the highest technology.\n\nTURBOTEC-PISTOLIS LTD has service station in China, Shanghai, for standard overhauling and emergency repairs of the ship.\n\nThus saving our customers valuable time and avoiding unnecessary expense. Guarantee is our professional experience. The company, continues providing certificates of Quality ABS-ISO 9001-2008."
    },
    {
        "name": "Zonas K. S.A.",
        "email": "Email: sales@zonas.gr , Email: zonas@otenet.gr",
        "phone": "210 41 33 919",
        "website": "www.zonas.gr",
        "location": "Greece",
        "address": "29 Polydefkous street, Piraeus, Greece, 18545",
        "about_us": "International Collaborations\nTHE Zonas S.A. has a reliable network of partners from renowned brands, such as Zita pump, Interpump Group, Pentax, Tellarini pompe, Sel Hoses, TMC, and for many others, ensuring responsibly and consistently the best quality in a very wide range of products.\nCombining years of experience, excellent know-how and dynamic partnerships, responding to the most demanding and challenging requirements of the clients.\n\n"
    },
    {
        "name": "Wärtsilä Oyj Abp",
        "email": "firstname.lastname@wartsila.com",
        "phone": " +358 10 709 0000",
        "website": "www.wartsila.com",
        "location": "Finland",
        "address": "Hiililaiturinkuja 2\nFI-00180 Helsinki Finland",
        "about_us": "Wärtsilä is a global leader in innovative technologies and lifecycle solutions for the marine and energy markets. We emphasise innovation in sustainable technology and services to help our customers continuously improve environmental and economic performance. Our dedicated and passionate team of 17,800 professionals in more than 280 locations in 79 countries shape the decarbonisation transformation of our industries across the globe. In 2023, Wärtsilä’s net sales totalled EUR 6.0 billion. Wärtsilä is listed on Nasdaq Helsinki."
    },
    {
        "name": "SUNTEC Industries France",
        "email": "",
        "phone": "+33 (0)3 80 70 60 70",
        "website": "www.suntec.fr",
        "location": "France",
        "address": "1 Rue Lavoisier , CS 60102\nF-21603 LONGVIC Cedex France",
        "about_us": "SUNTEC designs, manufactures and markets an unrivalled range of gear pumps and accessories.\n\nPartner of the largest heating system manufacturers (domestic burners, industrial boilers, mobile heating units and heating systems for vehicles), SUNTEC also offers technical solutions for all applications using a gear pump (high pressure cleaners, exhaust gas treatment, hydraulic systems,…)\n\nThanks to its two production sites, one in the United States in Kentucky, the other in Europe, in France, in the heart of Burgundy, SUNTEC has an extensive network of customers and distributors.\n\nThe quality, reliability and performance of its products have always enabled SUNTEC to offer innovative and pioneering products on the market."
    },
    {
        "name": "VALCO SURL PUMPS.MOTORS AND CONTROLS MANUFACTURING",
        "email": "valco@valco-costenaro.com ",
        "phone": "+39-0424-77847",
        "website": "www.valco.biz",
        "location": "Italy",
        "address": "Via dell'Industria, 27-29\nI-36063 MAROSTICA (Vicenza) - Veneto, (Venice Region) - EU - Italy",
        "about_us": "The Company was founded by Valerio Costenaro in 1976 in Marostica in the high technology region of VENETO, (Venice Region, North-east Italy).\nThe company has flourished by the design and manufacture of an expanding range of pumps, booster sets, motors and associated fittings for their installation, built-to-order and Custom made units with a worldwide distribution."
    },
    {
        "name": "BARRETT ENGINEERED PUMPS",
        "email": "CS@BarrettPump.com ",
        "phone": "619-232-7867",
        "website": "barrettpumps.com",
        "location": "United States",
        "address": "1695 National Ave\nSan Diego, CA 92113",
        "about_us": "Barrett Engineered Pumps is a complete pump house including system designs and engineering pumps for all markets and applications. We offer parts and service of all pumps regardless of the manufacturer. We represent pump manufacturers for three major markets: the commercial HVAC and plumbing market, the municipal water and wastewater market, and the industrial/marine markets."
    },
    {
        "name": "FOILEX Engineering AB",
        "email": "info@foilex.com",
        "phone": " +46-31 222525",
        "website": "www.foilex.com",
        "location": "SWEDEN",
        "address": "Säterigatan 25\n417 69 Göteborg\nSWEDEN",
        "about_us": "FOILEX Engineering AB is a Swedish marine engineering company established in 1991. We design and manufacture our own Oil Spill Response Products for the international oil and off-shore market."
    },
    {
        "name": "Xylem Inc.",
        "email": "",
        "phone": "",
        "website": "xylem.com",
        "location": "United States",
        "address": "301 Water Street SE, Suite 200\nWashington, DC 20003 United States",
        "about_us": "Xylem’s well-known global brands have served the water market for many decades with products sold in more than 150 countries. We listen, learn and adapt to local environments, working in true partnership with our customers. Our brands serve a number of industries including agricultural, construction, environmental, food and beverage, government agencies, industrial, public utilities, residential and commercial building services. With deep application expertise in the water industry, we focus on producing highly efficient water technologies that use less energy, reduce lifecycle costs and provide environmental benefits to users and the communities in which they operate."
    },
    {
        "name": "Grundfos Holding A/S",
        "email": "",
        "phone": "+45 87501400 ",
        "website": "www.grundfos.com",
        "location": "Denmark",
        "address": "Poul Due Jensens vej 7 8850 Bjerringbro, Denmark",
        "about_us": "Every one of us is impacted by water’s flow. At Grundfos, we want to ensure it’s accessible and reliable for all – to keep water flowing, while reducing the energy consumption that leads to increasing emissions.\n\nWe’re driven to take on the world’s water and climate challenges, developing solutions together with our customers, partners and suppliers that touch millions and millions of people every day, without most even noticing it.\n\nDiscover more about our intelligent, energy-saving pump and water solutions for water utilities, industries and buildings, and the people behind them. Here’s who we are, what we do and how we do it."
    },
    {
        "name": "OCEANDYNAMIC",
        "email": "info@oceandynamic.com",
        "phone": "+357 250 285 89",
        "website": "oceandynamic.com",
        "location": "Cyprus",
        "address": "Atlantis Building, Office No. 202, 2nd Floor,\n2 Archiepiskopou Makariou III,\nMesa Geitonia, Limassol, CY-4000, Cyprus",
        "about_us": "OCEANDYNAMIC is a company with the primary aim of providing high standard services and products to the Greek & Cypriot Shipping Community.\n\n\nThe company was initially established in 1997 and is supported by professionals such as Naval architects, Marine engineers, Refrigerating engineers, Marine electronics and Automation engineers. With many years of working experience in Shipping Companies and the Marine Field we have first-hand knowledge of the customers’ needs."
    },
    {
        "name": "FILTRO-MICHANIKI FILTERS",
        "email": "info@filtromichaniki.gr",
        "phone": " +30 2103413260",
        "website": "www.filtromichaniki.gr",
        "location": "Greece",
        "address": "9 Sperchiou Str,\n118-55 Athens, Greece",
        "about_us": "Manufacturers Filters for all filter types of market. Filtro Michaniki has been in business since 1985 serving the filtration needs of industry, marine industry. Highly trained filtration specialists are available to provide solutions to all filtration requirements.\n\nFiltro Michaniki is well situated (Athens) with sales offices located throughout our market area. We also have a available store five days a week to immediately respond to your filtration needs. Filtro Michaniki maintains a large stock of filtration products at our 10,000 square foot warehouse located in Athens, Piraeus, Thessaloniki & Patras.\nOur warehouses maintains a complete line of filter for Vessels .\n\nWe manufacture & import filters for all types. Partnered with leading factories of filters & raw materials. We provide complete filtration systems for variety of marine applications & shipping industries including filteration solution for industry, transportation, off road/mining, agriculture and automotive light truck. We combine groundbreaking research and development with award-winning lean manufacturing, marketing and customer support for all your filtration needs."
    },
    {
        "name": "TECHNOMATIC GROUP",
        "email": " info@technomaticgroup.gr",
        "phone": " +(30) 2310 752 773",
        "website": "technomaticgroup.gr",
        "location": "Greece",
        "address": "Esopou Str, Kalochori Industrial Park Thessaloniki 57009, Greece",
        "about_us": "Our company is trading industrial equipment since October 2016. We trade, repair and service complete compressed air units, pneumatic, vacuum and hydraulic systems. We undertake special customized applications and we assembly pneumatic and hydraulic cylinders as well as hydraulic power packs.\n\n"
    },
    {
        "name": "HYDRO TITAN",
        "email": "info@hydrotitan.gr\nsales@hydrotitan.gr",
        "phone": " (+30) 2105153957",
        "website": "www.hydrotitan.gr",
        "location": "Greece",
        "address": "Faonos 66, Akadimia Platonos\nAthens, Greece",
        "about_us": "With 45 years of experience in the field of hydraulic systems, Hydro Titan E.E. can support you in any need, whether it is for the purchase or repair and maintenance of hydraulic pumps, motors, valves, cylinders and components for the maritime, industrial, off-shore, mobile and mining industries. \n\n "
    },
    {
        "name": "Bosch Rexroth S.A",
        "email": "",
        "phone": "+30 210 3411600",
        "website": "www.boschrexroth.com",
        "location": "Greece",
        "address": "66, Chamosternas, Athens, Greece, 118 53",
        "about_us": "Bosch Rexroth is a leading provider of automation solutions for industrial and mobile applications. Our innovative products and services enable our customers to move everything that needs to be moved with ease and efficiency, helping them to win in their respective industries. We are a company that is helping to pave the way for the future. With our focus on digital innovation, sustainability, and our own people, we are not just moving things – we are moving industries to make our planet a better place."
    },
    {
        "name": "HAWE Hydraulik SE",
        "email": "info (at) hawe.de",
        "phone": "+49 89 379100-1000",
        "website": "hawe.com",
        "location": "Germany",
        "address": "Einsteinring 17\n85609 Aschheim/München\nDeutschland",
        "about_us": "HAWE Hydraulik SE focuses on the power density of hydraulics with its efficient and compact drive and control solutions. This technology can be used universally thanks to electronic control, modern interfaces and flexibility in terms of the drive type used. In keeping with our maxim Solutions for a World under Pressure, we are therefore contributing to sustainable business and energy-efficient machinery in countless industries.\n\nManufacturers of medical technology, wind turbines, machine tools and presses rely on our ready-for-connection solutions. In mobile work machinery, we are the contact partner for electrification, offering expert advice and a suitable modular product system."
    },
    {
        "name": "G. & I. Pangakis SA",
        "email": "info@pangakis.gr",
        "phone": "210-8810750",
        "website": "www.pangakis.gr",
        "location": "Greece",
        "address": "Paparigopoulou 46 & Lassani 121 32 Peristeri Greece",
        "about_us": "Since 1950 our company is one of the most important suppliers of the Greek industry and is ISO 9001 : 2015 certified. We provide tools and machines for the metal working and maintenance sector. We also supply a wide range of high pressure hydraulic systems.\n\nThe companies we represent are market leaders in their field and are known worldwide for their high quality products, ensuring the best price performance ratio.\n\nGet the benefits from our quality products, services and proven experience, like many of our important customers do.\n\nWe can offer you effective solutions at very competitive prices.\n\nPlease contact us and our qualified staff will serve you quickly and effectively."
    },
    {
        "name": "Hoppe Marine GmbH",
        "email": "sales@hoppe-marine.com",
        "phone": "+49 (0)40 561 949 0",
        "website": "www.hoppe-marine.com",
        "location": " Germany",
        "address": "Kieler Str. 318\n22525 Hamburg  Germany,",
        "about_us": "HOPPE is an independent family-owned group of companies and a leading supplier for fluid control and measurement systems in the maritime industry.\n\n‍We are offering global services through our own subsidiaries supported by our cloud based vessel data services to ensure a direct and fast customer support.\n\nOur solutions are known worldwide for high quality, precision and robustness. To keep this reliability and to guarantee an investment security for our customers drive innovation is an important part in our company strategy.\n\nHaving motivated and qualified people in our team is the key to secure our customer centricity, constant high quality, and continuous improvement.\n\nBased on seven decades of engineering know-how we help our partners to ensure a safe and efficient operation of their assets."
    },
    {
        "name": "CEJN AB",
        "email": "info@cejn.com",
        "phone": "+46(0)500-477500",
        "website": "www.cejn.com",
        "location": "Sweden",
        "address": "Visiting address: Rattvägen 1\nSE-541 34 Skövde, Sweden",
        "about_us": "Our quick connect couplings and related products and solutions are designed around energy efficiency and safety. With our core values Safety, Environment, Quality, Innovation and Performance, we are dedicated to the task to make work safer and more efficient with high quality quick coupling solutions."
    },
    {
        "name": "R+L HYDRAULICS GMBH",
        "email": "info@rl-hydraulics.com",
        "phone": "+49 (0) 2392 509-0",
        "website": "www.rl-hydraulics.com",
        "location": " Germany",
        "address": "Friedrichstr. 6, 58791 Werdohl, Germany",
        "about_us": "DEMANDING REQUIREMENTS. RESPONSIVE SOLUTIONS.\nR+L HYDRAULICS develops and manufactures an extensive as well as customized portfolio fitting your requirements for high quality components for fluid technology and power transmission. Individual solutions for high demands of components for mechanical engineering, ship and vehicle construction, steel industry and offshore technology as well as special purposes of plat engineering are an important part of your company´s success."
    },
    {
        "name": "Tri Tool, Inc",
        "email": "",
        "phone": "+1-888-305-1337, +1-916-571-0003",
        "website": "www.tritool.com",
        "location": " United States",
        "address": "3041 Sunrise Blvd, Rancho Cordova, CA, United States, 95742",
        "about_us": "Tri Tool is a global leader in the design of high-performance machine tools.  More importantly, we design solutions and are problem solvers. We are uncompromising in our dedication to our clients’ success and operate with leadership, partnership, and performance at the forefront of every mission"
    },
    {
        "name": "TaiXing Expansion Marine Equipment Co., Ltd",
        "email": "Email: txeme@163.com                                davidh-expansion@outlook.com ",
        "phone": "0086-523-80737090/ 80737091/80737092/",
        "website": "www.txeme.com",
        "location": "China",
        "address": "East Industrial Zone of Taixing City, Jiangsu Province,225400, China",
        "about_us": " TaiXing Expansion Marine Equipment Co., Ltd., (EME,stock number:691692), has extensive knowledge and expertise in designing and manufacturing deck machineries like towing winch, mooring winch, anchor windlass, capstan etc for barge, container vessel, tug, MPV, oil tanker, scientific exploration ship, the Navy vessels, and associated deck equipme nt as bollards, warping rollers, chocks, fairleads, anchors and chains . For every single type and size of vessel, EME provides deck plans for efficient and effective anchoring and mooring operations.\n    EME designs light weight but strong winches and other products with compact structure,  which are easy adaptable to specific needs and requirements and user friendly, reliable, sustainable and needs low maintenance only. EME uses advanced full-automatic CNC cutting machine for precise layout cutting, and purchases high grade raw materials and first class components from manufacturers with a worldwide service network.\n   EME currently has over 100 staff, 18 of them professional engineers specialized in designing and developing electric or hydraulic windlass with chain diameter less than 114mm (M3), electric/hydraulic towing winches, mooring winch, positioning winch, capstan with SWL less than 3500KN, special winch like cable winch, hose winch, high speed winch etc and all kind of deck fittings. EME has exported product to USA, UK, Holland, Romania, Brazil, Australia, Russia, Korea, Singapore, India, Greece, Malaysia, USA, India, Vietnam, Seychelles etc, and is awarded ISO9001:2008 management system certificate, DNV, GL, LR, ABS, BV, RS, IRS, and other relevant certificates by now. \n    EME covers an area of over 20,000㎡, with plant area over 6,000㎡, office and supporting facilities area over 4,000㎡. EME sets up mechanical laboratory and testing platform to conduct mechanical tests, at maximum, 350T dynamic load test and 800T static load test, to guarantee the materials meet designing requirements. \n    EME endeavors to provide best quality products and untiring service for customer satisfaction. EME is always abiding by \"credibility, cooperation, mutual benefit and win-win\" principle to make sincere cooperation with our friends in and abroad for a better future. \n\n"
    },
    {
        "name": "Emerson Electric Co.",
        "email": "",
        "phone": " +1 314 553 2000",
        "website": "www.emerson.com",
        "location": "United States",
        "address": "8000 West Florissant Avenue, P.O. Box 4100,\nSt. Louis , MO 63136, United States",
        "about_us": "Industry leaders are looking to Emerson as a trusted partner that continuously innovates to help them meet the next big challenge. Our robust automation portfolio enables us to collaborate across our businesses to develop more complete solutions for customers based on our deep industry experience. We leverage our global presence, domain expertise and industrial software to help industries achieve key sustainability and operational goals."
    },
    {
        "name": " Specken Hydraulics",
        "email": "info@speckenhydraulics.com",
        "phone": "+31 (0)78 691 10 11",
        "website": "speckenhydraulics.com",
        "location": "Netherlands",
        "address": "Van Hennaertweg 12\n2952 CA ALBLASSERDAM\nThe Netherlands",
        "about_us": "Specken Hydraulics was established in 1994. Over the past decades we have developed into a fully-fledged, customer-oriented partner in hydraulics. We not only deliver products, we provide professional advice and think along with you for customer-specific solutions. Are hydraulic parts no longer available? We offer alternatives. Repairing and manufacturing a part in our hydraulic workshop is also possible."
    },
    {
        "name": "Skoura SA hydraulics",
        "email": "info: skoura@otenet.gr       sales: sales@skoura.gr",
        "phone": "+30 210 3457874",
        "website": "hydraulicsgreece.gr",
        "location": " Greece",
        "address": "Orfeos 121, Athens 11855  Greece",
        "about_us": "Skoura SA hydraulics was founded in 1965. It is expertised in engineering with high competence in hydraulic components, equipment, and machinery by serving the industrial, mobile, and maritime sector. The expertise in the field and the consistency in high quality system solutions make the company the most reliable partner in designing, constructing, and distributing hydraulic systems by serving the industrial, mobile, and maritime sector. "
    },
    {
        "name": " Hanmi Hydraulic Machinery Co., Ltd.",
        "email": "",
        "phone": "051.305.2511",
        "website": "hanmihyd.com",
        "location": "Republic of Korea",
        "address": "24, Nakdong-daero 1420beon-gil, Sasang-gu, Busan, Republic of Korea",
        "about_us": "Leading company in the field of hydraulic equipment in the 21st century\nThe company was established in July, 1985 and is located in Samrak-dong, Sasang-gu, Busan, and is a company specializing in hydraulic machinery for engines of ship with 70 executives and employees. As a partner of Hyundai Heavy Industries, HSD Engine, STX Heavy Industries, Daewoo Shipbuilding & Marine Engineering and Samsung Heavy Industries, we produce world-class products based on the accumulated technology and credit and we export abroad about 30% of our total sales."
    },
    {
        "name": "Industrial Technologies SA",
        "email": "info@staffamotors.gr",
        "phone": "+30 2105142477 / +30 210 5151723",
        "website": "www.staffamotors.gr",
        "location": " Greece",
        "address": "18 Orhomenou Str. 12132 Peristeri, Athens  Greece",
        "about_us": "We are official distributors for Kawasaki Precision Machinery UK Ltd. (manufacturer of Staffa hydraulic motors) in Greece and Cyprus. Our company specializes in the design and assembly of hydraulic systems for industrial and marine applications (mooring winches, windlass).\n\nWe have more than 35 years of experience and technical know-how in selling, repairing and servicing Staffa motors. Our stock of (the most commonly used) original and brand new Staffa motors is kept in our Athens warehouse and we can arrange to ship them worldwide, in the manufacturer’s packaging, directly to your vessel.\n\nWe can also supply and directly ship original spare parts (pistons, connecting rods, bearings, seal kits, seal rings, shaft seals etc.) We have a workshop and repair facility where we can inspect and repair motors of all sizes."
    },
    {
        "name": "HANSA TMP ",
        "email": "hansatmp@hansatmp.it",
        "phone": " +39 059 415711",
        "website": "www.hansatmp.com",
        "location": "Italy",
        "address": "Via M. L. King, 6 41122 Modena (Italy)",
        "about_us": "HANSA TMP, to date, is an innovative company operating in the field of hydraulics and aims to produce high-performance and efficient components for mobile and industrial applications. The main objective of HANSA TMP is to optimise the efficiency of machinery, in particular industrial vehicles, by designing, producing and distributing high-performance hydraulic components and systems interconnected with electronics.  To achieve this goal, HANSA TMP relies on a multidimensional approach combining advanced fluid dynamic technologies and intelligent component and vehicle management strategies."
    },
    {
        "name": "Kawasaki Precision Machinery (UK) Ltd",
        "email": "",
        "phone": "+44 (0) 1752 364394",
        "website": "kawasakihydraulics.com",
        "location": "United Kingdom",
        "address": "Ernesettle, Plymouth, PL5 2SA. Devon, United Kingdom",
        "about_us": "\nWith annual sales revenues of $15 billon from 96 subsidiaries employing 35,000 people around the globe, Kawasaki Heavy Industries is a leader in its fields of engineering and technology.\n\nOur aerospace division is active in products ranging from aircraft to satellites. The products that our rolling stock division delivers to the world include Shinkansen and New York subway cars, while our ship and offshore structure division’s products range from gas carriers and large tankers to submarines, and our energy solutions division covers the spectrum from development and manufacture of energy equipment to management systems. We are also active in wide-ranging businesses driven by diverse and high-level engineering technologies, including environmental and recycling plants, industrial plants, precision machinery, industrial robots, and infrastructure equipment. Finally, we operate our leisure and power products business that features the motorcycles known as the Kawasaki brand. Through the development of unique and broad businesses unmatched elsewhere, we will continue to create new values that solve the issues facing our customers and society.\n\nEstablished in 1968 the Precision Machinery division of Kawasaki has been at the forefront of hydraulic technology and development for nearly 50 years.\nToday the Kawasaki brand is synonymous with quality and innovation in hydraulic pumps, motors, valves and complete systems across the whole spectrum of applications.\n\nWith manufacturing facilities in Japan, China, Korea, India and the UK and a global sales support network Kawasaki is ideally placed to support our customers worldwide."
    },
    {
        "name": "RC Hydraulik- und Industrieservice GmbH",
        "email": "",
        "phone": "+49 (0)4242 57756-0",
        "website": "www.rc-hydraulik.com",
        "location": "Germany",
        "address": "Werkstrasse 1\n28857 Syke/Germany",
        "about_us": "We like to introduce our company RC Hydraulik- und Industrieservice GmbH to give you a better overview about our activities, appreciate if you can take a short look on this.\n\nThe company RC Hydraulik- und Industrieservice GmbH has been grounded in 2004 and in the following section specialised,\ndrive and propulsion technology,\nspecial equipment construction,\nhydraulic systems, power packs, components, cylinders, piping\nservice and repair of deck equipment incl. cranes, anchor winches, hatch cover hydraulics etc.\nservice and repair of life saving equipment, davits, cranes and boats\nengineering and design\nelectric engineering, for a.m. equipment including own manufacturing\nAs the knowledge has been achieved over many years, at several leading hydraulic companies, the available know-how will be adopted for each new project.\nIn particular important during the close co-operation with our customers to establish the change for each order the most optimum solution.\nFurther our expertises in the life saving field, more than 25 years, has been obtained at some of the major life saving manufacturers."
    },
    {
        "name": "Antech Hydraulics",
        "email": "info@antech-hyd.co.uk",
        "phone": "01253 890037",
        "website": "antech-hyd.co.uk",
        "location": "United Kingdom",
        "address": "Cocker Ave Poulton Industrial Estate Poulton-Le-Fylde FY6 8JU United Kingdom",
        "about_us": "Antech Hydraulics is a privately owned independent company; we can remain flexible to our customer’s needs and provide a personal service that many others cannot. Established in 1995, we offer a full technical, support, supply and design service.\n\nWhether your products need to move, lift, turn, shape, dig, or haul, you can rely on Antech Hydraulics to deliver the performance you need to stay one step ahead in the ever-changing technologies of today. Antech’s dedication to supplying products for Mobile, Industrial, Oil & Gas, Marine and Wind Energy applications has made us one of the UK’s preferred suppliers of hydraulic components and systems.\n\nAntech Hydraulics supplies component parts from some of the strongest brands in the business. We can offer hydraulic pumps, motors, valves, cylinders, service, repair and full systems. We pride ourselves on our speed of response and technical knowledge to get you where you need to be both quickly and efficiently. Antech Hydraulics can assist whether you need a single component, a custom-engineered solution, or anything in between."
    },
    {
        "name": "Kobelt Manufacturing Co. Ltd.",
        "email": "sales@kobelt.com",
        "phone": "+1 (604) 572.3935",
        "website": "www.kobelt.com",
        "location": "Canada",
        "address": "8238 129th Street\nSurrey, BC, V3W 0A6\nCanada",
        "about_us": "Kobelt is a Canadian-based manufacturing company, with over 50 years of experience developing and producing high quality products for the marine and industrial sectors. Kobelt has an extensive history of innovation and product development and works with a wide variety of regulatory and classification requirements around the world for system certifications and approvals"
    },
    {
        "name": "Kolliopoulos",
        "email": " kolliopoulos@kolliopoulos.gr",
        "phone": "+30 210 5145255, +30 210 5150777",
        "website": "www.kolliopoulos.gr",
        "location": " Greece",
        "address": "62 FAONOS, AKAD. PLATONOS - 104 42 ATHENS  Greece",
        "about_us": "Having constructional and technological experience since 1976, our company is the first one ever dealt with construction and repair of hydraulic cylinders and today the most advanced and best equiped unit in our country. \n\nA few years now, we are exclusive distributors of STELMI ITALY, importing to greece high quality tubes and chrome plated bars of the highest standards, as well as sealing elements of any type and in any dimension, from the best manufacturers worldwide."
    },
    {
        "name": "GENERAL CONSTRUCTIONS IFAISTUS",
        "email": "nfo@ifaistus.gr",
        "phone": " +30 210 4614058,  +30 210 4615699,  +30 210 4628694, +30 210 4614299",
        "website": "www.ifaistus.gr",
        "location": "GREECE",
        "address": "METHONIS 45, PIRAEUS,\n18545, GREECE",
        "about_us": "We specialise in:\nHydraulic hoses for cranes for the most majors (MacGregor, IHI, TTS, Oriental, Kawasaki, Dong Nam, etc.)\nHydraulic systems : Supply of spare parts, motors, pump, valves - In house Repairs - Onboard Services (Repairs, Inspections, Maintenance, Troubleshooting).\nBWTS Retrofit (prefabrication, installation onboard during voyage and in drydock)\nAutomatic Greasing System (AGS) for Cranes\nCO2 Type Approved Hoses for major system (NK, UNITOR, KAWASAKI, etc.)\nTanker Unions\nErmeto\nManufacturing of HP and CO2 pipe fittings"
    },
    {
        "name": "Active Ship Management",
        "email": "info@activebdgroup.com  activebdgroup@gmail.com",
        "phone": "+8801831084654 +8801312400308",
        "website": "www.goodwillship.com",
        "location": "Bangladesh",
        "address": "98 Navy Well Fare Market, Chittagong, Bangladesh.",
        "about_us": "Active Ship Management – has more than 15 years of experience in working on shipping operation, ship repair, new & 2nd hand Good condition spare parts supply and marine services on home & abroad. We can provide all services, such as: ship repair, spare parts supply and maintenance of equipment, materials in the Chittagong port, Bangladesh."
    },
    {
        "name": "SUPER TECHNICAL FZCO",
        "email": "info@supertechnical.com",
        "phone": " +971 4 8861800",
        "website": "supertechnical.com",
        "location": "United Arab Emirates",
        "address": "Plot 19, Street S-109, JAFZA South, Post Box : 17646, Jebel Ali\nDubai- United Arab Emirates",
        "about_us": "For more than 45 years, Supertech Group is one of the leading business houses in the Middle East for the supply of Industrial Products & Services in the field of Oil & Gas, Petro-chemical, Food & Beverage, Power-Gen, Primary Steel, Automotive, Marine & Shipping and General Industries. We have in our stock nearly 50,000 line items from some of the most renowned manufacturers.\nToday, the company is headquartered in Jebel Ali Free Zone in Dubai with strategically located branches based in Dubai/Northern Emirates, Abu Dhabi and Qatar.\n\nDIVERSIFIED BUSINESS The growing demands in the Power Generation Industry has led to the establishment of \"Sun Power Gen Systems & Services\" (ISO 9001 certified). "
    },
    {
        "name": "SinoTrailers",
        "email": "sales@sinotrailers.com",
        "phone": "+86 18602 729 729",
        "website": "www.sinotrailers.com",
        "location": "China",
        "address": "NO. 42 GuangGuYi Road Wuhan China",
        "about_us": "Since 2007, SinoTrailers has more than 12 years of experience in offering total solutions for special transport. We specialized in designing, manufacturing, and supplying specialized trailers, self-propelled transporter, and other related heavy transport equipment and services from China Wuhan to the world.\n\nWith our knowledge, experience and high safety and quality standards, we can offer unique products and services with a full range of activities in heavy haul transportation, and we can always offer you a safe and cost-effective solution for various unconventional transport jobs. Besides supplying quality products, now we are offering all kinds of services related to project logistics."
    },
    {
        "name": "Jastram Technologies Ltd.",
        "email": " sales@jastramtechnologies.com",
        "phone": "+1-(604)-988-1111",
        "website": "jastram.com",
        "location": "Canada",
        "address": "135 West Riverside Drive\nNorth Vancouver, BC, V7H 1T6 Canada",
        "about_us": "Jastram Technologies, Ltd. (JTL) was established in 1983 in North Vancouver, as a Canadian distributor of high-quality marine equipment. JTL has offices and warehouses in North Vancouver, BC and Dartmouth, NS to provide sales, service and technical support from coast to coast.\n\nUnderstanding the Canadian marine market has always been critical to Jastram’s success. Combining an extensive inventory, highly skilled technical sales staff, factory trained service people, and in house professional engineers with a customer driven focus has given JTL a distinct competitive advantage.\n\nCommitment to excellence makes the selection of the finest manufacturers from around the world of utmost importance. With the quality products, dedicated support and the professionalism of our principals, JTL has been able to gain the trust and support of the Canadian marine industry.\n\nDue to the complex nature of Jastram’s product lines, the JTL team is composed of technicians and engineers with extensive training by each manufacturer. This ideology is further strengthened by a willingness to work with naval architects, ship owners, shipyard engineers and service personnel at any stage of vessel’s life, from design to construction to in-service challenges.\n\nJastram’s ongoing commitment to its customers will continue to drive the improvement of every aspect of the company."
    },
    {
        "name": "BY CONTROLS, INC.",
        "email": " by@bycontrols.com",
        "phone": "+82 55-345-6110",
        "website": "www.bycontrols.com",
        "location": " Rep. of KOREA",
        "address": "55, Jillye-ro 371beon-gil, Jillye-myeon, Gimhae-si, Gyeongsangnam-do, 50872, Rep. of KOREA",
        "about_us": "BY Controls, Inc. is a leading manufacturer of hydraulic & pneumatic control system and provides better solutions supporting marine and industrial applications with the latest technology and excellent quality. We have been supplying marine equipment over 40 years since our establishment in 1978 and having an excellent reputation from our customers."
    },
    {
        "name": "PK Application ",
        "email": "info@pkfilters.com",
        "phone": "211 4111630",
        "website": "pkfilters.com",
        "location": "Greece ",
        "address": "245 Syngrou ave Athens Greece ",
        "about_us": "European / American and Multinational Companiesand specialized in the Manufacturing of a variety of Mechanical equipment. PK APPLICATION is able to ensure the design and the installation of the required equipment for a wide range of applications and is specialized in the Filtration of Air , Liquids and Gases, Processing Compressed Air and Environmental Air, Water Treatment and Disinfection as well as Waste Management."
    },
    {
        "name": "Hansun (shanghai) Marine Technology Co,Ltd",
        "email": "info@hansun.com",
        "phone": "86-21-50793367",
        "website": "hansun-marine.com",
        "location": "China",
        "address": "Building 60, No.1000 Zhangheng Rd,Zhangjiang Hi-Tech Park, Pudong, Shanghai,China, 201203",
        "about_us": "HANSUN focuses on three main categories of products: seawater desalination, fresh water treatment and pollution prevention. Certified by major classification societies, such as ABS, BV, CCS, DNV-GL, KR, LR, NK, RINA and RS etc. \n\nWith a talented engineering team and through collaborations with prestigious institutions, HANSUN has established strong R&D capabilities and is capable of developing and applying state of the art technologies to the marine and environmental protection industry. "
    },
    {
        "name": "TRANSMARE SHIPPING & TRADING CO. LTD",
        "email": "info@transmare.com.tr",
        "phone": "0216 493 46 57",
        "website": "transmare.com.tr",
        "location": "Turkey",
        "address": "Evliya Çelebi Mahallesi. Gökçek Sokak, Filiz Hanım Apt . No: 3 Daire:2 TUZLA - ISTANBUL",
        "about_us": "Our company, which has 35 years of experience in the maritime sector, was operating in the field of electrical-electronic equipment of the newly-built ships with the company named “Elektromarin”, which was first established in 1985.\n\nOur company, which continues to follow the developments in the maritime and industrial sector with the TRANSMARE Maritime Import and Consultancy company, which was established in 1995, continues its activities until today by carrying out studies on changing technology.\n\nOur company generally uses wastewater treatment and online waste control systems, bilge separator, bilge alarm, various imaging and alarm systems for ships, fresh water generating devices, digital and analog heat, pressure, level measurement systems and online control systems, monitors, ships, yacht, boat security and satellite tracking systems, fleet tracking and navigation systems, solid metal ceramic coating, many foreign companies in matters disposal of liquid waste maritime represents in Turkey's market for industrial and automotive fields.\n\nIt also closely monitors international organizations such as IMO and international practices such as SOLAS and MARPOL. "
    },
    {
        "name": "RWO GmbH",
        "email": "info@rwo-gmbh.com",
        "phone": "+49 421 53705-0",
        "website": "www.rwo.de",
        "location": "Germany",
        "address": "Gerold-Janssen-Str. 2\n28359 Bremen, Germany",
        "about_us": "For over 45 years, RWO has been supplying future-proof solutions for marine water treatment – made in Germany. The product portfolio includes equipment for the treatment of drinking and process water as well as systems for pollution prevention such as oily water separators or sewage treatment plants.  \n\nToday RWO is recognized as a technological leader in the field of oil/water-separation with over 16.000 units delivered worldwide. More than 40 sales and service stations ensure short communication links and local availability of trained service engineers. The intelligent spare parts supply enables the rapid delivery of customized kits, which minimizes maintenance intervals as well as freight and operating costs. RWO offers an individually designed range of services: around the world, around the clock, 365 days a year. "
    },
    {
        "name": "Hermont Marine Inc.",
        "email": " info@hermont.com",
        "phone": "514-856-1212",
        "website": "www.hermont.com",
        "location": "Canada",
        "address": "100-19501 Clark Graham\nBaie D'Urfe, Quebec\nCanada H9X 3T1",
        "about_us": "Hermont started as a supplier of excellent marine products and today is recognized as a provider of quality and economical solutions in pollution abatement and energy efficiency improvements.\n\nGernot Seebacher founded Hermont Marine Equipment Inc in 1984 with the goal to supply excellent products, supported by good application knowledge. Early on he saw the need for better service in the areas of pollution abatement, one “necessary evil” for the owners, the step-child of marine equipment. Today Hermont is well known for their expertise in oily water matters as well as other areas, such as engine efficiency."
    },
    {
        "name": "TOTAL MARINE SOLUTIONS INC.",
        "email": " INFO@TMS-FLA.COM",
        "phone": "+1 (954) 327-2032",
        "website": "www.tms-fla.com/",
        "location": "United States",
        "address": " 2800 W STATE ROAD 84, SUITE 111,FORT LAUDERDALE, FL 33312 United States",
        "about_us": "Total Marine Solutions was established in 2000 with a specific mission to supply environmental products and services with a commitment to customer service and consistent, reliable support.\n\nBringing over twenty years of support expertise in both the sales and purchasing functions of ship operations, the management team at TMS maintains a mindset of ensuring a heightened standard of service excellence. This standard motivates our processes and overall way of doing business."
    },
    {
        "name": "CROSS TECHNICAL SERVICES LTD",
        "email": "info@cross.com.gr\ntechnical@cross.com.gr",
        "phone": " +30 2104284070-1 +30 2104180670",
        "website": "www.cross.com.gr",
        "location": " Greece",
        "address": "2, Afentouli street, P.O. 18536 Piraeus, Greece",
        "about_us": "CROSS Technical Services was founded in 1989 in Piraeus, aiming to provide trustworthy, turnkey technical solutions to the Greek Shipping Industry. Covering a wide range of high quality equipment and systems, CROSS has become one of the leading technical solution providers worldwide for both existing ships and new buildings.\n\nSince its establishment, CROSS has provided services to almost every shipping company in Greece and many worldwide. From providing spare parts and equipment, up to installing and commissioning complete and complex automation solutions, CROSS today has a strong presence in the maritime industry.\n\nThe company’s long-standing commitment to continual improvement through technological innovation and eco-friendly solutions, has led to new fields of commercial environmental activity such as Ship Efficiency & Energy Management, Fuel Consumption Measurement, Reduction of Ship’s Emissions, Oil Discharge Monitoring and more."
    },
    {
        "name": "MR Marine Group",
        "email": "info@mr-marinegroup.com",
        "phone": "+31 10 714 48 82  +65 6268 0890",
        "website": "mr-marinegroup.com",
        "location": "Netherlands",
        "address": "Walenburgerplein 106\n3039 AN Rotterdam\nThe Netherlands",
        "about_us": "Mr. Marine trades under Mr. Marine Elevator, Mr. Marine Ballast and Mr. Marine Instruments & Controls. Our dynamic company aims at keeping vessels safe and compliant, anywhere in the world. With technical know-how, unparalleled spare part sourcing and 24/7 responsiveness, we are your global beacon."
    },
    {
        "name": "Alfa Laval Corporate AB",
        "email": "alfa.laval@alfalaval.com",
        "phone": "+46 46 36 65 00",
        "website": "www.alfalaval.com",
        "location": "Sweden",
        "address": "Rudeboksvägen 1\nSE-226 55\nLund Sweden",
        "about_us": "Alfa Laval is a leading global provider of first-rate products in the areas of heat transfer, separation and fluid handling. With these as its base, Alfa Laval aims to help enhance the productivity and competitiveness of its customers in various industries throughout the world. We define their challenges and deliver sustainable products and solutions that meet their requirements – mainly in energy, the environment, food and the marine industry."
    },
    {
        "name": "JOWA AB",
        "email": "spareparts@jowa.se  logistics@jowa.se sales@jowa.se",
        "phone": "+46-31 726 54 00",
        "website": "jowa.com",
        "location": "Sweden",
        "address": "Tulebovägen 104\n428 34 Kållered Sweden",
        "about_us": "JOWA has supplied the maritime industry with environmental protection equipment for more than 60 years and has earned a solid reputation. Our goal at JOWA is to continuously strive to manage and develop this goodwill. We are specialists in water treatment and protection of the marine environment. Our products are designed to contribute to the global ecology by protecting the marine environment with the latest and best technology. All our products are user friendly systems that are easy to install and operate."
    },
    {
        "name": "Fuji Automation Pte Ltd",
        "email": "sales@fuji.com.sg",
        "phone": "+65 6481 4646",
        "website": "fuji.com.sg",
        "location": "Singapore",
        "address": "Blk 1 Ang Mo Kio Industrial Park 2A\n#03-13 AMK Tech I\nSingapore 568049",
        "about_us": "Located in Singapore, Fuji Automation is one of the major suppliers and distributors for Marine Automation and Control related products in Singapore. Our core business comprises wide range of comprehensive services such as overhaul, predictive and preventive maintenance of control equipments and control system, instrumentation &amp; designs and installation of new system onboard of the vessel.\n\nIn Fuji Automation, we only represent and supply products with proven track record in both product quality and excellent after-sales-services from well-known manufacturers. (Please refer to our product area).\n\nOur clients are shipyards, ship owners, ship manager and agents, trading houses and repair workshops. Our world-wide service network assures regular re-calibration of the equipment in all major ports."
    },
    {
        "name": "MARITECH HELLAS LTD",
        "email": "sales@maritechgroup.com",
        "phone": "+30 216 9005 500",
        "website": "maritechgroup.com",
        "location": "Greece",
        "address": "9A Tripoleos Str, 18863, Neo Ikonio, Perama Piraeus   Greece",
        "about_us": "MARITECH is an independent spare parts provider and repair specialist of Plate Heat Exchangers and fluid handling equipment, with a strategic network to support its customers worldwide since 1977.\n\nWith half a century of experience, first-hand expertise and passion for excellence, Maritech offers world-class engineering solutions to real-world challenges, create sustainable value and make the difference."
    },
    {
        "name": "ERGOMATIC MARINE & INDUSTRIAL EQUIPMENT",
        "email": "ergomatic@ergomaticltd.com",
        "phone": "+30 210 4408000, +30 210 2448144",
        "website": "ergomaticltd.com",
        "location": "Greece",
        "address": "Ag.Petrou 13 Av. & Iroon Politechniou, Athens, Acharnes 136 75 Greece",
        "about_us": "ERGOMATIC is an established solution provider in the marine & industrial fields, supplying high quality equipment and integrated automation solutions.\n\nThe company has grown rapidly, becoming a worldwide supplier for all kind of valves and piping equipment as well as automation components and solutions in pneumatic, hydraulic and electronic systems.\n\nOur state of the art facilities, equipped with state-of-the-art machinery, automation and calibration laboratories, and an expansive warehouse inventory, have played an important role in the expansion of our activities."
    },
    {
        "name": "DCSI LTD",
        "email": "dcsi@dcsi.gr",
        "phone": "+30 210 41 81 833",
        "website": "dcsi.gr",
        "location": "Greece",
        "address": "107-109 Filonos street, Piraeus, Greece, 18535",
        "about_us": "DCSI Ltd is a marine technical consulting and commercial firm, established in 2001. We follow a client oriented philosophy where knowledge and technical expertise are utilized to propose quality and cost effective solutions. The company has presence in Piraeus, Limassol and Gdansk while services are offered worldwide.  Our team is comprised nowadays of Marine Engineers and Naval Architects, Electronic and Automation Engineers, project and sale managers and other highly educated and qualified personnel, driven people caring about getting the work done and building on long term business relationships.   Our clientele includes numerous prestigious, Greek and European Shipping companies enjoying world class reputation.\n\nMajor repair shipyards and shipbuilders trust our services and are represented by us, while major makers do so, as well.\n\nWe are the authorised sales agency for Samsung marine equipment, power and control systems and the authorised European training centre and spare parts centre for ‘Purimar’ BWTS system.\n\nWe work under a certified quality management system.\n\nOur engineers are authorized and certified by most of the major Classification societies (NKK, DNV-GL, ABS, LR, BV, GL), the Greek Flag administration and makers such as Samsung to carry out after sales support on marine, bridge and engine communication control systems and radio surveys at very competitive prices.\n\nWe are still focused to provide high technological products and services into the maritime world through an integrated total customer services support.\n\nWe continuously establish newcollaborations to improve our services, our response and our global presence. Within a competitive business world, we leverage our long-standing expertise towards an economic and, comprehensive correspondence to our consumers’ requirements at any time without delay."
    },
    {
        "name": "TeamTec AS",
        "email": "OFFICE(a)teamtec.no LOGISTICS(a)teamtec.no",
        "phone": "+47 37 19 98 00",
        "website": "teamtec.no",
        "location": "NORWAY",
        "address": "TeamTec AS\nP.O. Box 203\nN-4902 Tvedestrand NORWAY",
        "about_us": "Since 1984, TeamTec AS has established itself as a world leading manufacturer of waste incinerators and stripping ejectors. TeamTec products are well-known in the marine and offshore industry.\n\nIn February, 2021 TeamTec expanded its portfolio with TeamTec Senza Ballast Water Management System (BWMS) which is IMO approved and has successfully completed the stringent test regime by the US Coast Guard and obtained a USCG type approval in 2021.\n\nIn September, 2017 TeamTec aquired TeamTec Oceansaver Ballast Water Management System (BWMS) which is also approved by IMO, and has successfully obtained a USCG type approval in December 2016."
    },
    {
        "name": "ERMA FIRST ESK Engineering S.A",
        "email": "",
        "phone": "30 210 40 93000",
        "website": "ermafirst.com",
        "location": "Greece",
        "address": "Schisto Industrial Park (VIPAS), Block 13 Keratsiniou-Skaramagas Ave., 188 63 Perama, Greece",
        "about_us": "ERMA FIRST has been developing cutting-edge BWTS solutions and has set the standard for effective ballast water treatment with superior operational readiness, build quality and ease of use. In addition, ERMA FIRST is an experienced manufacturer of pioneering sustainable marine equipment solutions.\n\nWorking with some of the largest shipping companies in the world, ERMA FIRST is known for its high-quality systems and after-sales service range. Our systems are installed on over 2,500 vessels and our customer-centric approach offers flexible and convenient servicing through a trusted network of certified engineers worldwide."
    },
    {
        "name": "Ecochlor ",
        "email": "sales@ecochlor.com",
        "phone": "+1 978 298 1463",
        "website": "ecochlor.com",
        "location": "United State",
        "address": "285 State Street, Suite 8\nNorth Haven, CT 06473 United State",
        "about_us": "Our collaborations with innovative maritime business solutions providers are intended to deliver enhanced economic performance by providing environmentally sound products and services to the maritime industry.\n\nThe beneficial impact of our mission for the environment is limitless.Committed to saving our coastal ecosystems, Ecochlor developed a proprietary ballast water management system (BWMS) that has been specifically designed to safely and economically eliminate the worldwide transfer of aquatic invasive species. Chlorine dioxide disinfectant has many advantages over other treatment technologies."
    },
    {
        "name": "SunRui Marine Environment Engineering Company Ltd",
        "email": "guoy@sunrui.net hexg@sunrui.net",
        "phone": "+86-532-68725819, 86-532-6872570",
        "website": "sunrui.net",
        "location": "China",
        "address": "149-1 Zhuzhou Road, Laoshan District,Qingdao,China",
        "about_us": "SunRui Marine Environment Engineering Company Ltd (hereinafter referred to as SunRui) is a wholly owned subsidiary company of China Shipbuilding Industry Company Limited (CSIC). SunRui is a high-tech integrated engineering company built up in 2003, engaged in research, design, manufacture, engineering, test and project contracting of marine environment corrosion control and water treatment.\n\nSunRui is becoming the leader of the field of marine environment engineering, makes contributions to blue economy, marine environmental protection and marine power strategy, with driving force of science and technology innovation, providing customers with comprehensive solutions, insisting on internationalization strategy, leading rapid development of industry and centered around resource saving and environmental protection."
    },
    {
        "name": "Technomare Techonology",
        "email": " tmare@otenet.gr",
        "phone": " +302104082861-2",
        "website": "www.technomare",
        "location": "Greece",
        "address": " Socratous 210, 18755, Keratsini, Pireus, Greece",
        "about_us": "TECHNOMARE TECHNOLOGY develops designs, manufactures and provides services for electrical, electronic, new installation and repair works, pneumatic and automation systems in the marine and industrial field. (from scratch to installation).\nTECHNOMARE TECHNOLOGY was founded in 1987 by Mr.Antonios Maravelias as a personal company in St.George in Keratsini.\n\nInitially the company had 12 employees and was involved into electrical / electronic repairs and installation as well as in marine automation systems.\n\nWithin few years as a result of the quality work, professionalism and close relationship with its clients, the company expanded into its present form.\n\nThe company moved to the self-owned premises in 1990 at its current location 210 Sokratous str. in Keratsini where the personnel was given the opportunity to get involved with more specific constructions projects.\n\nThe new century finds TECHNOMARE TECHNOLOGY fully equipped and organized with over 45 certified Electrical, Mechanical, Software and experienced technicians assembling a team ready to keep up with technology development."
    },
    {
        "name": "M.E. Solutions",
        "email": "info@mesab.eu",
        "phone": "+46 8 400 25455",
        "website": "mesab.eu",
        "location": " SWEDEN",
        "address": "M.E. Solutions AB\nOstmästargränd 3\n120 40 Årsta   SWEDEN",
        "about_us": "M.E. Solutions’ core idea is to contribute to a greener industry sector, whether it be on land or at sea. We believe that through technology we can change humanity’s impact on the environment to be less tomorrow. To do this we need a sea of knowledge and experience, not only from one field, but from many."
    },
    {
        "name": "Goltens Rotterdam B.V.",
        "email": "rotterdam@goltens.com",
        "phone": "+31 181 465100",
        "website": "goltens.com",
        "location": "Netherlands",
        "address": "Lorentzweg 29\n3208 LJ Spijkenisse\nThe Netherlands",
        "about_us": "Goltens is the only independent repair specialist to offer owners, managers and OEMs all-inclusive worldwide service.\nEach year over 3,000 clients including ship-owners, shipyards, industrial plants and power stations, rely on Goltens to organize, plan and perform critical maintenance and repair work.\n\nGoltens’ logo is one of the most trusted trademarks within the worldwide repair and service industry. Building a trustworthy trademark, like Goltens, just doesn’t happen overnight, it takes years of hard work, reliable service and solid reputation."
    },
    {
        "name": "Trident Maritime Systems",
        "email": "Info@TridentLLC.com  Sales@TridentLLC.com",
        "phone": " 703 236 1599",
        "website": "tridentllc.com",
        "location": "United State",
        "address": "2011 Crystal Drive Suite 1102\nArlington, VA 22202 United State",
        "about_us": "At Trident Maritime Systems, we are dedicated to program excellence — and to promoting your long-term success. With a century of experience delivering complex, integrated maritime solutions, we are proud to support the performance and business goals of our customers around the world.\n\nWe are dedicated to making your work faster, cleaner, stronger, safer and smoother."
    },
    {
        "name": "Comas Electronics",
        "email": " info@comaselectronics.com",
        "phone": "+30 210 4610493",
        "website": "comaselectronics.com",
        "location": "Greece",
        "address": "Sokratous 37\nPiraeus 18648 Hellas Greece",
        "about_us": "Our company is active in the marine Alarm -Monitoring and control systems service and support field for the last 30 years.\n\nThe main issue is that most of the existing systems are not suppported by their makers any more or their service translates to extremely high costs, and must be replaced.\n\nThe most important problem though is that there is currently no other alternative and certified system in the market in order to replace the problematic one.\n\nCOMAS ELECTRONICS designed, developed and manufactured similar devices, which are approved and certified in accordance with the IMO regulations, in order to solve the above described problems with the Alarm – Monitoring and control systems, and have a very easy solution for its clients, even for the most difficult cases, for all types of ships, for engine room systems, or deck systems.\n\nOur devices easily adapt and replace almost every existing device that causes unsolved problems on a vessel. Replacing the faulty existing system, resulting to a completely new system with two years warranty, maintenance free, We are now in position to declare that our company can successfully take over any electronic or pneumatic automation system service.\n\nAnd, of course, we address to the heavy industry of vessel repair/maintenance, the Shipyards, with complete and responsible co-operation proposal."
    },
    {
        "name": "Helcoma Overseas",
        "email": " info@helcoma.com",
        "phone": "86 051385151119, +86 15121000910,  +30 6956094998",
        "website": "helcoma.com",
        "location": "China",
        "address": "8 West Zhongxiu Rd\nLife Style Plaza Bldg 1 Room 512-513 Nantong-226000 China",
        "about_us": "Helcoma Overseas was founded in 2009 located at Nantong China, in order to act as an Automation and Power integrator in the maritime industry.\n\nFurther to our client’s satisfaction Helcoma Overseas added Navigation & Communications services covering a wider range of services. All these years Helcoma Overseas is continuously following the technology in order to provide state of the art solutions, quickly and efficiently.\nOur company’s strong point is the technician’s well knowledge and the quick delivery time.\n\nThe experienced technicians, the customer focus, as well as the “zero problem policy” are the added values that Helcoma Overseas offers to all of its customers.\n\nOur vision and our target is “EVERY repair work & every installation to be beyond customer’s satisfaction”"
    },
    {
        "name": "HENSOLDT United Kingdom",
        "email": "",
        "phone": "+44.19.9280-5200",
        "website": "hensoldt.net",
        "location": "United Kingdom",
        "address": "Voltage, 6 Mollison Avenue\nEnfield, EN3 7XQ\nUnited Kingdom",
        "about_us": "HENSOLDT UK, formerly Kelvin Hughes, is a world leader in development, manufacture and supply of maritime navigation and surveillance radar systems. HENSOLDT UK employs over 170 employees and are headquartered in Enfield, North London. The company sets the international standard in solid state radar sensor technology with SharpEye and its market leading navigation and tactical radar display systems.\n\nThe core product technology of HENSOLDT UK is SharpEye – a radar transceiver launched in 2006 that brings military grade target detection at an affordable price to warships and offshore patrol vessels. SharpEye is a solid state pulse Doppler navigation and surface search radar sensor and differentiates to the competition through its extremely high reliability and ability to detect very small Radar Cross Section (RCS) targets in severe weather or high clutter conditions.."
    },
    {
        "name": "MA D. ARGOUDELIS & CO S.A",
        "email": "cma@cmagreece.com, sales@cmagreece.com\n",
        "phone": "+30 210 46 15 831, +30 210 46 33 826",
        "website": "cmagreece.com",
        "location": "Cyprus",
        "address": "Themistokli Dervi, 41 HAWAII NICOSIA TOWER, 8th floor, Flat/Office 806-807 1066, Nicosia, Cyprus",
        "about_us": "MA D. ARGOUDELIS & CO S.A is fully complied by ABS with ISO certificates, and is a member of major global associations in the marine market for the supply of its products.\nWe specialize in Marine and Industrial Automation meeting all our customer’s needs across the globe.\nThe company is located in the port of Piraeus, which is the largest port in Greece and among the largest in the world. In addition to Cosco development since 2009 in the area, marine business is growing rapidly and the target is to be the largest port worldwide.\nOur private 11th floor 1500sq.mt building was built in 2010 offering full functionality for all our scopes and taking our business to the next level."
    },
    {
        "name": "Space Electronics Ltd",
        "email": " info@spacel.gr",
        "phone": " +302104174614",
        "website": "spacel.gr",
        "location": "Greece",
        "address": "6 Sotiros Dios str. 18535\nPiraeus, Greece",
        "about_us": "Space Electronics Ltd, founded in 1976, has been since one of the leading marine electronics, navigation and communication companies in Greece.\n\nRepresenting some of the most renown and important manufacturers of the world, Spacel offers products of cutting-edge technologies, unique and integrated solutions, worldwide technical service support by our experienced, up-to-date trained and officially certified engineers.\n\nBeing vividly involved in the area of New Building Projects in Europe and Far East, Spacel is pioneering in providing its expertise, experience, full support and complete packages of marine electronics, e-navigation and automation systems.\n\nIn cooperation with partners always promoting and sensing for the future, Space offers solutions and applications for most advanced digital technology, e-navigation, vessels’ optimization towards higher efficiency, eco solutions, cyber security and autonomous shipping."
    },
    {
        "name": "Anschütz Germany",
        "email": "service@anschuetz.com",
        "phone": "+49 (0)431 3019 96440 ,  +49 (0)1716510708",
        "website": "www.anschuetz.com",
        "location": "Germany",
        "address": "",
        "about_us": "Anschütz is one of the world's leading manufacturers of navigation, bridge and mission systems for commercial shipping, offshore and research vessels, workboats, mega yachts, coast guard and naval vessels, and submarines.\n\nAnschütz stands for experience and expertise in navigation like no other company, with passion and innovation being just as much part of our roots as the goal of making navigation at sea reliable and safe. Our mission is to work with our team of experts around the world to ensure safety and reliability in navigation on the high seas. "
    },
    {
        "name": "NAVITRON SYSTEMS LTD",
        "email": "sales@navitron.co.uk",
        "phone": "023 9249 8740,  +44 23 9249 8740",
        "website": "navitron.co.uk",
        "location": "United Kingdom",
        "address": "17 The Tanneries, Brockhampton Lane\nHavant, Hampshire, PO9 1JB",
        "about_us": "Navitron Systems Ltd is an independent British company based near Portsmouth on the south coast of England.\n\nSpecialists in the design and manufacture of Classification Society Approved Main Steering Controls and a comprehensive range of Type Approved Autopilot systems and associated equipment for commercial vessel applications, the company is internationally represented by leading brand distributors of marine electronic equipment.\n\nMED Module D and ISO 9001 Quality Certificated (ISO 9001:2015) a key feature of Navitron policy is ‘in house’ product design and development which ensures maximum levels of company expertise in all operational aspects from design input through production to end user support.\n\nCommensurate with this theme it is noteworthy that Navitron Systems Ltd is the first UK manufacturer of fully Type Approved autopilot systems to latest IMO and ISO specifications including wheelmarked systems in accordance with MED 96/98/EC."
    },
    {
        "name": "LEADMAR Ltd",
        "email": "sales@leadmar.gr",
        "phone": "+30 210 9700200, +30 693 6329000",
        "website": "leadmar.gr",
        "location": "Greece",
        "address": "31 Vouliagmenis Av. Glyfada - Athens, ZIP 16675 Greece",
        "about_us": "EADMAR since 2005 has combined it's name with the sea, summer and entertainment by providing you with high standard Inflatable Boats of GRAND with all types of outboard engines of your choice and equipping them with the latest technology from SIMRAD."
    },
    {
        "name": "MAREL Electronics",
        "email": "info@marel.gr",
        "phone": "+302104123943",
        "website": "marel.gr",
        "location": "Greece",
        "address": "Sotiros Dios 6, Piraeus, 185 35, Greece",
        "about_us": "MAREL Electronics is a specialist supplier and service company for Bridge Navigation Electronics and Ship Communications equipment founded in 1966.\n\nThe company focuses on the Greek Commercial Shipping, the Passenger Ferry and the Super yacht markets and offers branded products for navigation and communication, turn-key maritime solutions for Internet Connectivity and CCTV for onboard security and monitoring.\n\nWith a team of dedicated service engineers and an international partner network MAREL supports all supplied products and offers worldwide service coordination for on-board services (equipment installation, repair, maintenance, annual surveys), remote troubleshooting and operator training. We look forward to receiving your call or email to inquire more information on our product offerings or to ask for assistance for any technical issue or communication problem you may have onboard your vessels. We are happy to assist you."
    },
    {
        "name": "FURUNO U. S. A",
        "email": "",
        "phone": "+1 360 834 9300",
        "website": "furunousa.com",
        "location": "United State",
        "address": "4400 N.W. Pacific Rim Boulevard. Camas, Washington 98607-9408, United State",
        "about_us": "Since our inception in 1948, when the world's first fish finder was commercialized, FURUNO ELECTRIC CO., LTD. has been responding to the needs of the maritime industry through developing various types of marine electronics. Today, FURUNO is a total marine electronics manufacturer operating on a global scale with a great many loyal customers."
    },
    {
        "name": "Aqua Marine Electronics",
        "email": "info@aquamarine.gr ",
        "phone": "+30 210 4619007",
        "website": "aquamarine.gr",
        "location": "Greece",
        "address": "49 Sfaktirias Street, Piraeus 185 46 Greece",
        "about_us": "AQUA MARINE ELECTRONICS based in Piraeus at 49, Sfaktirias str. and is operating since 1992 within a broad range of activities such as supply, installation and service of marine electronic equipment, for commercial and pleasure vessels.\n\nThe organisation is offering the following services:\n\nMain areas of activity include communications and navigations equipment, spare parts, service and installation of equipment, as well as technical studies and customised packages made possible by highly skilled personnel.\n\nAQUA MARINE ELECTRONICS is also able to cater for the needs of large yacht, be it sail or motor, with the supply and installation of communication and navigation equipment."
    },
    {
        "name": "NUNOTANI NAUTICAL INSTRUMENTS MANUFACTURING CO.LTD",
        "email": "",
        "phone": "+81-6-6448-5566",
        "website": "nunotanihakuyoukk.jp",
        "location": " Japan",
        "address": "1-15-20 Edo-bori, Nishi-ku, Osaka, 550-0002 Japan",
        "about_us": "Nunotani has developed related technologies and products, in addition to magnetic compasses. Our present portfolio of development, manufacturing and marketing includes engine telegraphs, logger units, various remote control units, rotating meters, Rudder Angle Indicator, wipers, Clear View Screen, wind direction & velocity meters, and so on"
    },
    {
        "name": "Tototheo Trading Ltd",
        "email": "info@tototheo.com",
        "phone": " +357 25 569 155",
        "website": "tototheo.com",
        "location": "Cyprus",
        "address": "89, Omonoias Avenue., Limassol 3048, Cyprus",
        "about_us": "For decades now, we specialize in maritime technology solutions focusing on optimizing vessel and fleet performance.\n\nOur services include innovative, efficient and functional solutions in the fields of satellite communication, navigation systems, digitalization and end-to-end cyber security services.\n\nOur offices in Cyprus, Greece & Germany offer complete solutions starting from pre-sales consultancy all through onboard installation and maintenance and after sales support. Through our teams and partners located in Europe, USA, Middle East and Far East we provide a global reach with a local touch.\n\nWe invest heavily in research and development, in partnership with our customers, providing fit-for-purpose solutions, always considering the complex interactions between assets and resources within our industry.\n\nOur strength lies in our people who apply their experience, know-how and willingness to listen, towards offering the right solutions. We are driven by our passion and expertise to provide the solutions our customers need for a sustainable future."
    },
    {
        "name": "A.B.E. INZENJERING D.O.O.",
        "email": "info@abe-inzenjering.hr",
        "phone": "385-51317410",
        "website": "www.abe-inzenjering.hr",
        "location": "Croatia",
        "address": "Vodovodna 17, Rijeka, Croatia, HR-51000",
        "about_us": "A.B.E. Inženjering d.o.o. is a company established in 1989 by electronic engineers\nwith over twenty-five years of experience in marine applications.\n\nThe company is situated in the port of Rijeka - the largest marine centre in Croatia.\n\nMain activities are sales, service and installation of equipment from leading\nmanufacturers in the marine electronics business.\n\nOver the years the company has developed its technical and commercial capabilities\nand has been approved by all major classification societies."
    },
    {
        "name": "ElectroMed",
        "email": "service@electromedmarine.com",
        "phone": "+350 200 77077, +34 956 632 274, +44 (0)7480 111457",
        "website": "electromedmarine.com",
        "location": "Gibraltar",
        "address": "44D New Harbours Rosia Road Gibraltar",
        "about_us": "ElectroMed has been servicing shipping in Gibraltar Spain and beyond for the past 30 years, and had a vast history of service history and experience to draw upon. We are a small team and we specialise in representing the manufacturers that we support in the highest of standards. A great deal of preparation takes place before every job that we do in order to ensure that the attending engineer has the correct information and spare parts in order to complete the work and leave the system operating correctly without the requirement of a follow up visit.\n\nOur engineers are able to conduct work whilst in Port, at anchorage, during bunker operations or at sea. We have installed many gyro compasses, radars and other navigation equipment whilst the vessel has been on passage thereby reducing of hire time.  Our travel charges are very realistically priced allowing our engineers to travel to your vessel wherever it is at an economical rate.\n\nBesides the supply, installation and commissioning of marine navigation, and communication equipment Electromed also is certified by many of the classification societies to carry out annual radio surveys on vessels in our area of operations.\n\nElectromed also had a fire department which specialises in fire detection and suppression we are able to plan and install fixed fire suppression systems as well as portable first aid appliances fire detection panels and fire fighting accessories.  We are also able to inspect existing installations up to the standard of several classification societies."
    },
    {
        "name": "Beijing Highlander Digital Technology Co., Ltd",
        "email": "",
        "phone": "+86 21 55955330, 55955310",
        "website": "highlander-global.net",
        "location": "China",
        "address": "Room 501, 1050 East Daming Road,\nHongkou District, Shanghai 200082 China",
        "about_us": "The Highlander company, formally chartered in Year 2001 as the Beijing Highlander Digital Technology Co., Ltd., is today one of around two thousand companies listed on the Shenzhen Stock Exchange (SZSE), the eighth largest stock exchange in the World measured by market capitalization.  Highlander’s business activities fall into three areas:\n1)  Advanced equipment and systems for seagoing vessels.\n\n2)  Multi-sensor systems for monitoring maritime and airport activity.\n\n3)  High-end instrumentation and services for the oceanographic and hydrographic sectors."
    },
    {
        "name": "ELINE-Karageorgis",
        "email": "eline@eline.com.gr",
        "phone": "+30 210 96 46 174 / 175",
        "website": "eline.com.gr",
        "location": "Greece",
        "address": "",
        "about_us": "ELINE-Karageorgis as they call us today is a family company, acting as Representatives ,or Agents or Dealers and or Distributors of well known Makers for sea, land and air electronic equipment. Also it's involved in boating, hotels and restaurants business."
    },
    {
        "name": "Netwave B.V.",
        "email": "sales@seasofsolutions.com  info@seasofsolutions.com",
        "phone": "+44 (0)23 9262 3900, +31 (0)881181500, +31 (0)621502167",
        "website": "seasofsolutions.com",
        "location": "Netherlands",
        "address": "Blauw-roodlaan 100,\n2718 SJ Zoetermeer, Netherlands",
        "about_us": "Seas Of Solutions product portfolio is renowned for marine electronics innovation, having revolutionized marine safety with the development of the first compact Personal Locator Beacon (PLB) and has continued to drive the adoption of lifesaving technology with the first AIS MOB device in 2012, the first AIS EPIRB in 2017 and the first Galileo PLB in 2018. That innovation continues with the latest FastFind PLB the world’s first to include the Return Link Service."
    },
    {
        "name": "Raymarine UK Limited",
        "email": "",
        "phone": "(+44) (0)1329 246 700",
        "website": "raymarine.com",
        "location": "United Kingdom",
        "address": "Marine House, Cartwright Drive, Fareham, PO15 5RJ, United Kingdom",
        "about_us": "For more than 80 years, we‘ve been global leaders in high performance marine electronics for the recreational boating and light commercial marine markets. We continue to innovate and provide full electronic systems to boaters around the world. Our products are engineered for the tough marine environment and renowned for ease-of-use, rugged design and reliability. Our full range includes chartplotters, fishfinders, radars, marine instruments, marine cameras, AIS units and VHF radios.\n\nOur customers include offshore fishing captains, luxury cruising boat skippers, sailors and professional mariners, and we’re the trusted navigation system supplier to the U.S. Coast Guard. With close to 100 years of technological innovation on the water, we have offices in 12 countries and partner with over 7,500 dealers and installers in 110 countries.\n\nOur vision is to be the solution of choice for every mariner."
    },
    {
        "name": "GENERAL FILTERS S.A",
        "email": "filters@filters.gr",
        "phone": "(+30) 2104132805",
        "website": "filters.gr",
        "location": "Greece",
        "address": "Retsina 11-13 Piraeus Post Code 185-45  Greece",
        "about_us": "We know your world and we know your needs. Therefore, we put our expertise at your disposal.\nGeneral Filters S.A. can provide marine lubricants and filters for all machinery onboard.\nGeneral Filters S.A succesfully follows engines new technology and environmental requirements that shipping industry is following.\nTherefore, our products are designed to meet the demands of today’s modern fleets and other shipping industries.\n\nOur cooperation with world-class manufacturers such as TOTAL lubricants and Baldwin filters combined with our expertise keeps your investments secured and with low badget.\n\nTo choose the correct lubricant and the most suitable filter, please contact us and we will provide a complete setup for any engine.\n\nAt General Filters S.A. you can find several type of products such us: filters – antifreezes -lubricants- and special filter constructions easily, based on your specifications.\nWe ship all over the country and can deliver filters and lubricants through reliable partners around the whole Greek coast,\nso wherever you are located in Greece we have the solution to send the goods.\n\nOur experience about filters, allows us to prevail in this area, fabricating integrally filters , covering exactly your needs."
    },
    {
        "name": "Filtrex s.r.l",
        "email": " info@filtrex.it",
        "phone": "+39 02 7533 841",
        "website": "filtrex.it",
        "location": "Italy",
        "address": "94b, via Rubattino - Milano 20134 (ITALY)",
        "about_us": "Filtrex is strongly committed to supply products with quality characteristics always compliant to customer requirements.\n\nCustomer satisfaction is our goal, achievable with a dynamic implementation and the continuous improvement of our ISO9001 Quality System, certified since 1995 from Lloyd’s Register.\n\nQuality management is fully integrated into all business processes and it is a significant factor in our global success.\n\nISO3834-2 Certification for Welding activities, ASME U-Stamp Certificate of Authorization and PED Certification for pressure vessel design and construction complete the scenario of our Quality.\n\nJob related surveys from other main notified bodies such as DNV-GL, ABS, Bureau Veritas, TÜV and many others are also performed for the conformity assessment of our products."
    },
    {
        "name": "MIE Company Ltd",
        "email": "commercial@miecompany.eu",
        "phone": "+30 210 4598800",
        "website": "miegreece.gr",
        "location": "Greece",
        "address": "1 Kanari Str. Piraeus 185 37 Greece\ntel: +30 210 4598800",
        "about_us": "MIE Co Ltd was founded in 1977 in Cyprus defining one-stop full service maritime supply.\n\nAlmost 40 years later, MIE and its Greek Branch Office in Pireaus have evolved immensely and are now designing and building Company Presence and Local Identity. In what is probably the world’s toughest maritime market, we are here to help you rise and thrive.\n\nWe know our Market and we know International Markets.\n\nContinuous and Extensive Market Analysis combined with uninterrupted Support and Monitor are at the core of MIE’s Operations. Through a dedicated, highly skilled team of professionals, localized market penetration is as easy as you can think with the operation costs staying competitively low and you can always count on dealing with an ever expanding Customer Portfolio offering exciting business opportunities."
    },
    {
        "name": "Boll & Kirch Filterbau GmbH",
        "email": " info@bollfilter.com",
        "phone": "+49 2273/562-0",
        "website": "bollfilter.de",
        "location": "Gremany",
        "address": "Siemensstr. 10-14, Kerpen, GERMANY, D-50170",
        "about_us": " We are a worldwide operating and leading manufacturer of filters â€“ certified under ISO 9001/14001 and approved by more than 80 classification societies. We are specialist for the filtration of liquids and gases. Our automatic, duplex and simplex filters are the result of our own research and development and comply with international technical standards. BOLLFILTERs protect important parts such as valves, pumps and bearings from contamination and accumulation of mud. They are installed into the pressure line or suction line. Depending on type and application, the filter housings are made of grey cast iron, nodular grey cast iron, carbon steel or CrNi-steel. They are designed in accordance with national and international regulations and standards. Continuous or intermittent operation, manual or fully automatic cleaning of the filter elements will determine the choice of filter type."
    },
    {
        "name": "VTE-FILTER GmbH",
        "email": "",
        "phone": "+49 40 5210890",
        "website": "vte-filter.com",
        "location": "Gremany",
        "address": "Hans-Böckler-Ring 29-33\n22851 Norderstedt Gremany",
        "about_us": "VTE is a long-established family business with a world-wide reputation and is characterized by Hanseatic business traditions. Virtues like reliability, rationality, foresight, respect and knowledge are the focus of VTE’s actions. International customers from a wide range of industries as well as the entire shipping area trust VTE’s products.\n\nThe sustainable economic success can be clearly seen in the healthy growth of the company, which is underlined with a lot of international know-how. VTE’s employees speak a diverse range of languages to ensure communication runs smoothly. From English to French, Hindi, Portuguese, Tamil, Russian, Spanish to Danish and Albanian – VTE covers a wide range of languages."
    },
    {
        "name": "C.C.JENSEN A/S",
        "email": "sales@cjc.dk ccjensen@cjc.dk   \n\n",
        "phone": "+45 6321 2014 ",
        "website": "www.cjc.dk",
        "location": "Denmark",
        "address": "Loevholmen 13\n5700 Svendborg Denmark",
        "about_us": "C.C.JENSEN - the global leader in oil maintenance with 70 years of experience - designs and manufactures CJC® Offline Oil Filtration solutions for removal of particles, water, acidity and oil degradation products (varnish) from hydraulic oils, lube oils, gear oils, diesel fuels etc.\n\nOur CJC® Filter Inserts are made of 100% natural cellulose fibres from sustainable resources: No metal, no plastics, and no chemicals."
    },
    {
        "name": "Filterkon LTD",
        "email": "filterkon [@] filterkon.com",
        "phone": "+211 7001273",
        "website": "filterkon.com",
        "location": "Greece",
        "address": "2, Vas. Amalias – 145 61 Kifissia – Greece",
        "about_us": "Was established in 1978 by Mr. George Konstantinidis, it started with the exclusive representation for Greece of Boll und Kirch Filterbau GMbH. Since then we have expanded our co-operation with many German machinery and equipment makers and also our sales area to include Bulgaria (BOLLFILTER) and Cyprus (Hammelmann). We always strive to achieve an expert knowledge in the equipment we provide. We know that any product is only as good as its after sales service! Therefore we always maintain a rigorous training and seminar schedule to ensure that we provide best possible advise and support as well as sales. Since early 2003 the company is run by Mr. Alexander Konstantinidis who succeeded his father as managing director of the company. In 2005 our company received an ISO 9001:2000 certification from DQS.\nIn April 2014 our company restructured as part of our growth strategy and became FILTERKON LTD."
    },
    {
        "name": "Jowa Hellas Ltd",
        "email": "info@jowa.gr",
        "phone": "(+30) 210.9932 011",
        "website": "jowa.gr",
        "location": "Greece",
        "address": "Konstantinou Metaxa 14 Str.\n174 55 Alimos\nAthens Greece",
        "about_us": "Business vision Technology for living oceans Jowa has supplied the shipping industry with environmental protection equipment for more than 60 years and has earned a solid reputation. Our goal at JOWA is to continuously strive to manage and develop this goodwill. We are specialists in water treatment and protection of the marine environment. Our products are designed to contribute to the global ecology by protecting the marine environment with the latest and best technology. All our products are user friendly systems that are easy to install and operate.\n\nWe are proud to protect our oceans. We are all dependent on animal and plant life in our oceans remaining healthy and continuing to flourish. Issues relating to the marine environment are subject to strict rules and regulations. JOWA´S products are approved and recommended by a large number of leading authorities in marine legislation. JOWA is one of the leaders in the business area of environmentally friendly equipment and has strong research and development credentials.\n\nWe collaborate with respected academic institutions in order to maintain our position at the forefront of the latest industrial developments and to meet the growing competition in the market."
    },
    {
        "name": "Walker Filtration Ltd",
        "email": "sales@walkerfiltration.co.uk",
        "phone": "+44 (0) 191 417 7816",
        "website": "walkerfiltration.com",
        "location": "United Kingdom",
        "address": "Birtley Road,\nWashington, Tyne & Wear\nNE38 9DA United Kingdom",
        "about_us": "Walker Filtration is an established and recognised leader in filtration technology. Established in 1983, Walker Filtration’s commitment to exceptional and innovative design, along with a proven track record of engineering excellence, has enabled us to provide our customers with solutions at the forefront of compressed air and gas filtration and drying technology for over 35 years.\n\nAs a pioneer in advanced filtration, drying and separating technology, we are committed to delivering unique design, exceptional engineering and manufacturing excellence. We are trusted partners of choice for our OEM clients, distributors, and end users and we pride ourselves on understanding our customer needs."
    },
    {
        "name": "Interfilter",
        "email": "info@interfilter.gr",
        "phone": "210 342 5514",
        "website": "interfilter.gr",
        "location": "Greece",
        "address": "Papastratou 55, Piraeus 18545, Athens Greece",
        "about_us": "Back in 1973 and under the name FILTROTECHNIKI we started our business with main activity the manufacturing and trading of filters for engines. During all these years there were other business activities with the main object of importing and marketing filters. The most famous are MOTOR SERVICE S.A., INTERFILTER LTD but also Savvopoulos - Eveidis OE. (SAEV). INTERFILTER - TSILIKAKOU I. & CO. EE is the natural continuation and the 2nd generation of filters manufacturing family business. Today we represent many major filter manufacturers such as Mann & Hummel, WIX Filters (now belongs to the group Mann & Hummel), Alco Filters, Smart Filtration Solutions but we also work with internationally recognized companies for our raw and auxiliary materials such as JP Air, Fratelli Marianni, Ahlstrom-Munksjö, Maris Polymers."
    },
    {
        "name": "AERODYNAMICS",
        "email": "",
        "phone": "(+30) 210 2582771, 210 2582772, 210 2520065, 210 2520988",
        "website": "aerodynamic.gr",
        "location": "Greece",
        "address": "18, Gaitanaki, N. Philadelphia, Athens, Greece, 143 42",
        "about_us": "The company AERODYNAMIC E.P.E. began her operation from 1974 aiming at the import and marketing of filters of humid/gases and industrial equipment, essentially in the Greek manufacture, the industry but also kat’ extension the Greek family (filters of treatment of water). The products that imports the AERODYNAMICS are sold Pan-Hellenic via networks of resellers.\nARMING objective of AERODYNAMIC is it imports and it trades products of most excellent quality, with complete cover the technical and functional characteristics that are required by the users and in competitive price. The technical support of products, is also a sector that it gives particular gravity the AERODYNAMICS."
    },
    {
        "name": "Dimtech S.A.",
        "email": " info@dimtech.gr",
        "phone": "+30 210 53 25 404-5 ,+30 210 40 14 733",
        "website": "dimtech.gr",
        "location": "Greece",
        "address": "K. Karamanli & Iroon Polytechniou, Aspropyrgos, 19300 Attica, Greece",
        "about_us": "The necessity for environmental protection leads to developing and applying specialized solutions and new technologies.\n\nRecognizing the necessity for air quality, DIMTECH develops and manufactures treatment systems that cover the particular requirements of each application.\n\nFor almost 20 years, we have been building cooperative relationships with our customers and suppliers based on our know-how, high-quality, and innovative ideas.\n\nInvesting constantly in green technologies R&D and the development of our human resources allows us to provide sustainable and durable air treatment solutions in both industrial and commercial applications.\n\n"
    },
    {
        "name": "FILTERTECH-G.CHALIKIAS S.A.",
        "email": "info@filtertech.gr",
        "phone": "2310 533504, 2310 540341",
        "website": "filtertech.gr",
        "location": "Greece",
        "address": "Mazaraki 2 & Κ. Roulia\nP.C 546 27 - Thessaloniki Greece",
        "about_us": "FILTERTECH-G.CHALIKIAS S.A. is a company with headquarters at Thessaloniki Greece, branch office at Athens Greece , and operates since 1983 covering its customers’ needs in the field of industrial applications and especially into production, distribution and filtration of compressed air, gasses (including medical gasses) and steam, water treatment, all kind of liquid filtration, air and HVAC filters, nitrogen and oxygen generators, and finally systems for processing, stirring and homogenizing fluids.\n\nIt originally started as a personal business attempt of mister George Chalikias himself and during all this years the company has been transformed into an S.A. with Mr. George Chalikias as the president of the Board of directors and Mrs. Elefteria Chalikia and Mrs. Paraskevi Chalikia as the two other members of the Board (CEO / CEO & Vice President respectively).\n\nFILTERTECH is now a fully modern and dynamic company. Accumulated know-how and multiannual engagement experience with the subject combined with our capability to keep abreast of events and developments allow us to be in the advantageous position to offer integrated solutions to all kind of industrial, commercial or domestic requirements."
    },
    {
        "name": "MPW Filter Worldwide",
        "email": "",
        "phone": "561-393-3915\n",
        "website": "mpwfilter.com",
        "location": "United States",
        "address": "7568 SW Jack James Drive\nStuart, FL 34997\nUnited States",
        "about_us": "MPW Filter is leading the way in the next generation of fuel systems for today's tier 4 engines and beyond. We have been in the industry for over 30 years. In the 30 years we have brought new products to market for other companies. Now with our patents we are releasing our new patented systems which allows MPW to change and adapt to your needs quicker then our competition. So when you have a filtration problem or if you want the latest technology MPW will be there for you and your company."
    },
    {
        "name": "Fil-Tec Rixen GmbH",
        "email": "info@fil-tec-rixen.com",
        "phone": "+49 (0)40 6568560",
        "website": "fil-tec-rixen.com",
        "location": "Germany",
        "address": "Ingenieurbüro für Filtertechnik Osterrade 26 21031 Hamburg Germany",
        "about_us": "High-quality products offer you a long service life and associated infrequent maintenance, saving you time and money. From our many years of experience, we know what disadvantages you suffer as a result of inferior products: frequent replacement, repair and damage. So that this does not happen, you should rely on high-quality products.\nQuality. Know-How. Flexibility. Fil-Tec Rixen GmbH® stands for long-lasting filters and spare parts. With our in-house production in Hamburg, we guarantee the highest quality, on-time production and fast delivery.\n\nFrom Hamburg to the whole world. Fast. Flexible. High quality."
    },
    {
        "name": "Hydor S.A",
        "email": "sales@hydorsa.gr , safety@hydorsa.gr, forwarding@hydorsa.gr",
        "phone": "+30 2104224259, +30 2104179170, +30 2104179064",
        "website": "hydorsa.gr",
        "location": "Greece",
        "address": "15, Methonis Str, 18545, Piraeus, Greece",
        "about_us": "Hydor S.A., founded in 1984 and based in Piraeus, is a global leader in supplying marine and industrial equipment.\nAs a manufacturing and commercial company, with a creative focus on marine spare parts and equipment for pumps, purifiers, air compressors, a wide range of hoses, and accessories, as well as press fitting systems, we offer high-quality products, expertise, continuous improvement, and professionalism.\nOur company is staffed with specially trained and highly motivated specialists.\nOur expertise and individual dedication enable us to achieve our goal of providing customers with prompt and personalized service.\nThanks to our extensive experience in the marine industry, we can guarantee our customers high-quality products, excellent after-sale support, and maintenance to meet their needs.\nWe continually seek new and innovative methods to better serve our customers and strive to remain at the forefront of the market, addressing the global needs of our customers.\nWe consistently upgrade our service facilities and expand our production line, resulting in comprehensive service for our customers.\nWe can provide our customers with a quick response and delivery to the highest standards, regardless of how small or complex the request, as we operate 365 days a year, 24 hours a day."
    },
    {
        "name": "KYROS MARITIME SPARE PARTS ",
        "email": "info@kyrosmsp.com",
        "phone": "(+30) 2104610996",
        "website": "kyrosmsp.com",
        "location": "Greece",
        "address": "71 Kapetanidou Str.\nDrapetsona 18648\nPireas , Hellas, Greece",
        "about_us": "KYROS MARINE SPARE PARTS is company specialized in selling alternative marine spare parts of all the major manufacturers, such as: ALLWEILER, ALFA LAVAL, AZCUE, WESTFALIA, MITSUBISHI, IMO, GEA, HISAKA, APV."
    },
    {
        "name": "Universe Shipping and Trade Links",
        "email": "ustl.sales@gmail.com",
        "phone": "+91 98210 18577",
        "website": "spares-ships.com",
        "location": " India",
        "address": "6,Nilgiri, Deonar Baug,Deonar, Mumbai, Maharashtra, India, 400088",
        "about_us": "We deal in ships spares especially in main engine, aux engine, turbochargers, air compressors, separators, pumps, fresh water gensets, rubber fenders, anchor and anchor chains etc., reclaimed from demo vessels.\nWe maintain ready inventory of spares at our works, we can also meet specific demand as we are in a position to locate any unusual spares rapidly and are in constant touch with all scrap yards.\nWe supply spares world-wide to various ships owners, managers and trading co's, and we are in this field for the last 12 years.\nOur group is also actively involved in ship agency, ship chartering, ship chandling etc."
    },
    {
        "name": "JNE Marine Ltd",
        "email": "info@jnemarine.com",
        "phone": "+30 210 9532022, +30 210 9373888",
        "website": "jnemarine.com",
        "location": "Greece",
        "address": "137, Solonos str. (2nd Floor)\n17675 Kallithea, Athens, Greece",
        "about_us": "JNE Marine Ltd is headed by Mr. Nikos Theodorou, His moto: “We do believe that we have the capacity and we are dedicated to rigidly support our clients”.\n\nIt is a well rooted and established company in the Greek shipping market, providing a wide range of products and services for more than 25 years.\n\nJNE Marine Ltd has persistently labored over the years to build customer’s trust and establish an extensive portfolio averaged to 250 ship management and owning companies within 2022, reflected by a retention rate that exceeds 90% in both the Greek and Cypriot market"
    },
    {
        "name": "PanMarine & Industrial Services Ltd",
        "email": " info@panmarine.gr",
        "phone": "+30 2104129783",
        "website": "panmarine.gr",
        "location": "Greece",
        "address": "3 Agiou Konstantinou Str., 18531 Piraeus , Greece",
        "about_us": "PanMarine & Industrial Services Ltd was established in Piraeus, to accommodate the needs of the Greek Marine, Power and Industrial sectors. Distinguished professionals joined forces to form a unique think-tank of acute intellect, committed to unrivaled excellence on the projects contracted. Working as a team, we share a mutual vision: to offer our customers first class engineering and consulting services."
    },
    {
        "name": "Separator Spares International (UK) Ltd",
        "email": "enquiries@separator-spareparts.com\n\n",
        "phone": " +44(0)1983 813020",
        "website": "separator-spareparts.com",
        "location": "United Kingdom",
        "address": "Unit 1A – Ryde Business Park\nRyde Isle of Wight\nP033 1BQ United Kingdom",
        "about_us": "Separator Spares International (UK) Ltd (SSI) is the largest independent manufacturer of alternative spare parts in the world.  We specialise in Separation, Pumping and Filtration.  With over fifty years combined experience within the centrifuge industry, our in house manufacturing based in the United Kingdom, we believe we have more experience than any alternative supplier.\n\nFrom a seal ring to a complete centrifuge system, SSI can provide solutions for all of your separation and spare parts requirements.\n\nSSI manufacture processes are extremely accurate and enables the company to satisfy all engineering and operational criteria of the original parts in fit, form and function."
    },
    {
        "name": "Deckma Hamburg GmbH",
        "email": "post@deckma.com",
        "phone": "+49 40 5488760",
        "website": "deckma.eu",
        "location": "Germany",
        "address": "Kieler Str. 316 · 22525 Hamburg · DE-Germany.",
        "about_us": "DECKMA HAMBURG GmbH is a well established company, supplying Oil-in-Water Monitors and Systems to the marine and industrial markets since the early 1970's. The Managing Director, Mr. Günther Schulze, founded the company as a representation office in Germany for companies like Bailey Meters, Metritape, Tanksystem and Bristol Babcock Ltd. DECKMA HAMBURG GmbH has been involved in sales, service, engineering and development of 15 ppm Bilge Alarm Monitors and Tanker Deballasting Systems from the beginning of the MARPOL regulation 73/78 for pollution prevention equipment on board of ships."
    },
    {
        "name": " TEMAK ",
        "email": " info@temak.gr  ",
        "phone": "+30 210 2581 583",
        "website": "temak.gr",
        "location": "Greece",
        "address": " 62, Tatoiou str., GR 136 77, Acharnes (Menidi), Athens, Greece",
        "about_us": "TEMAK’s dedicated team of engineers primary studies, designs & manufactures Water Treatment Solutions, providing custom made systems for all applications via filtration, Ultra filtration (UF), reverse osmosis (RO), softening, Deionization and other technologies combined. For any new enquiry, more information about our products, etc, please fill the necessary information or the form attached “Request for Quote” ask us to provide you, with our “Project Enquiry form and the Analytical Water chemical Analysis”, in order to accurately design the custom made, W.T.S. system, for your needs."
    },
    {
        "name": "Omnium Enterprises Inc.",
        "email": "webinquiries@omnium.gr",
        "phone": "+30 210 4287118",
        "website": "omnium.gr",
        "location": " Greece",
        "address": "27-29 A. Metaxa Str\nGlyfada - Greece",
        "about_us": "Omnium is a fully integrated single sourcing, supply-chain, distribution and logistics company.\n\nProviding a fully comprehensive procurement and supply chain solution to our customers worldwide, we offer a competitive, reliable and cost effective solution across both onshore and offshore industries for clients operating in Europe, Middle East and the USA region\n\nOmnium is a Specialist Maritime & Industrial supplies and equipment provider, our range of supply is so diverse that it covers the full spectrum of industry supply ranging from specialist and capital equipment right down to daily consumables."
    },
    {
        "name": "Dalwin Marine",
        "email": "dalwin@dalwin.com",
        "phone": " +65-60116658, +91-9820044878(M) ",
        "website": "dalwin.com",
        "location": "Singapore",
        "address": "47A Tuas South Avenue 1\nTuas Core Industrial Center\nSingapore 637329",
        "about_us": "Dalwin Marine is a well established ISO 9001:2015 certified organization dealing in service, repair and spare parts of turbochargers of marine and land based power plants .\n\nDalwin Marine has a joint venture with Marine Turbo Eng. Ltd, UK (Estd: 1970) in the field of turbochargers. The team of highly skilled and rich experienced professionals render the best quality service at an economical cost with time bound commitments to our customers.\n\nThe entire technical team at Dalwin Marine through its global network is able to provide prompt service for all makes of turbocharger on 24*7 basis. The technicians are regularly trained by in-house experts and at manufacturer’s works ensuring the best quality services.\n\nOur team of experienced and skilled technicians including ex-OEM experts help to provide the best service to improve the efficiency of turbocharger for our customers in most cost effective manner.\n\n\"Our strengths lies in providing complete technical solution to our customers for turbochargers like complete overhauling, repairs, re-blading, technical modifications, retrofit projects, solving problems like surging, etc\"\n\nWe always welcome customer feedback to improve from all aspects."
    },
    {
        "name": "DIESEL CAT LTD",
        "email": "info@diesel-cat.com",
        "phone": "+30 210 55 91 141",
        "website": "diesel-cat.com",
        "location": "Greece",
        "address": "Diilistirion Avenue, Aspropyrgos, Greece, 193 00",
        "about_us": "DIESEL CAT LTD was established in 1991.\n\nSince our inception we have supplied the maritime and petrochemical industries with quality parts and service. We are well known within Greece, as well as being popular with our international customers.\n\nWith many years of experience and a strong reputation, we are ready to support your needs."
    },
    {
        "name": "MedMar Marine Services ",
        "email": "sales@medmar-services.com",
        "phone": "+30 2105617612 (6 Lines)",
        "website": "medmar-services.com",
        "location": " Greece",
        "address": "G. Skouze 10 & Filonos, Piraeus 18536, Piraeus, Greece",
        "about_us": "MedMar, is an accredited Group of Companies with presence both in Greece and Hong Kong supplying Marine Spare Parts and Technical Support.Our established network of Distributors gives us the ability to provide Parts with exceptional quality and our dedicated Service team can provide Solutions anywhere around the globe if requested."
    },
    {
        "name": "ODME - EUROPE",
        "email": " sales@odme.eu.com ,  technical@odme.eu.com",
        "phone": "(30) 210 5986179, (30) 210 5986213, (30) 210 5310551, (30) 210 5310674\n",
        "website": "www.odme.eu.com",
        "location": "Greece",
        "address": "5, Kimonos Str.\n122 44, Egaleo - Athens Greece\n",
        "about_us": "ODME – EUROPE is trading through Darlas Electronic Applications SA or Darlas - Hellas.\nDARLAS – HELLAS for 30+ years (from early 1980's till 2012) served as an Exclusive Sales and Service Agent for SERES France and from 2005 till 2007 for SEIL-SERES Korea, representing their Oil Discharge Monitoring Equipment, e.g.: ODME Ballast Monitors."
    },
    {
        "name": "Ramtec Marine Systems",
        "email": "service@ramtec-marine.com              sales@ramtec-marine.com\n\n ",
        "phone": "+1 281 334 2904",
        "website": "ramtec-marine.com",
        "location": "United States ",
        "address": "373 Columbia Memorial Parkway, Houston, United States ",
        "about_us": "Ramtec Marine Systems offers full scope of service for wide range of Marine Automation Systems:\nsurvey  inspection,  trouble-shooting repair retrofit design engineering fabrication installation  commissioning after sale support.  Authorized services and spares for PRAXIS automation"
    },
    {
        "name": "Autotech",
        "email": "info@autotech.gr",
        "phone": " 210 57 80 019",
        "website": "autotech.gr",
        "location": "Greece",
        "address": " Gionas 11, Peristeri – PO 121 33, Athens Greece",
        "about_us": "Autotech designs and manufactures remote control and other automation products. In particular, it develops and manufactures wireless remote control systems, telematics systems, vehicle fleet management, intelligent lighting systems, automation for garage doors, automation for household and industrial rolling shutters, sensors etc. \n\nSince its foundation in 1984, Autotech has been making an ever-ascendant course in the development and production of high-tech industrial and domestic automation. "
    },
    {
        "name": "MANTANCO S.A",
        "email": "info@mantanovitch.gr",
        "phone": " +302104611010",
        "website": "mantanovitch.gr",
        "location": "Greece",
        "address": "40 Aegaleo & 35 Antinavarchou Konstantinou Panana Str.,\n185 45 Piraeus, Greece",
        "about_us": "Our company ''MANTANCO S.A.'', established in year 2000 in Piraeus from the merger of the companies TH.MANTANOVITCH S.A (1978) & KATSAROS AUTOMATION (1950), two of the oldest and very well-known companies, in the Greek market. We are a commercial and technical company, dealing with measuring, control equipment and automation.\n\nWe run a sales store and a fully equipped service station. Our activities, cover all the needs and sections (level, flow, temperature, pressure etc.)\n\nAmong our customers, are the biggest industries, refineries, shipping companies and shipyards in Greece & Cyprus.\n\nOur company is certified by Bureau Veritas with ISO 9001:2005. All its products bear the CE marking as required by relevant regulations."
    },
    {
        "name": "Turbomed SA",
        "email": " turbomed@otenet.gr",
        "phone": "(+30) 210 4000111, (+30) 210 4003070",
        "website": "turbomed.gr",
        "location": "Greece",
        "address": "Schisto Industrial Park, Str. 1 No 2\n188 63 Perama, Hellas Greece",
        "about_us": " \nTURBOMED SA with 46 years of presence in the field of turbocharger services, holds a leading position in the domestic and international market providing turbocharger services and spare parts for Marine & Navy, Oil & Gas, Power Plant and Auto & truck turbochargers.\n\nExperience, high expertise, professionalism, consistency and accountability is some of the principles that permit the company to offer high quality products and value-added services to customers.\n\nAs an independent family business, all its members love their occupation in this profession and enjoy the experience it offers. The staff of TURBOMED, about 35 people, consists of experienced, certified professional technicians and engineers who are available 24/7, 365 days a year at any place around the world."
    },
    {
        "name": "TURBO THEOMAR",
        "email": " turbothe@otenet.gr, info@turbotheomar.com",
        "phone": "+ 30-210-4621208",
        "website": "turbotheomar.com",
        "location": "Greece",
        "address": "7 ETOLIKOU STR, Piraeus, Greece",
        "about_us": "TURBO THEOMAR is specialised Turbocharger's Spare parts supplier in region.\n\nWe have a large inventory of turbochargers ready for shipping, or we will repair your turbochargers.\n\nOur turbos carry a warranty equivalent to new turbos. Each turbo is measured and balanced according to manufacturer’s specifications."
    },
    {
        "name": "Kompressorenbau Bannewitz GmbH",
        "email": "info@kbb-turbo.com , reinhard.ernst@kbb-turbo.com",
        "phone": "+49 351 4085 626 , +49 351 4085 664",
        "website": "kbb-turbo.com",
        "location": "Germany",
        "address": "Windbergstraße 45, Bannewitz, Germany, 01728",
        "about_us": "KBB Turbo stands for quality \"Made in Germany\", innovation and comprehensive expertise with over 70 years of experience in the development and production of turbochargers.\n\nThanks to a strong culture of innovation and with continuous further developments, we offer products that are characterized by high efficiency and are based on decades of expertise and state-of-the-art technology."
    },
    {
        "name": "Tru-Marine Pte Ltd",
        "email": "turbo@trumarine.com",
        "phone": "+65-68618398",
        "website": "trumarine.com",
        "location": "Singapore",
        "address": "35 Tuas Basin Link\nSingapore 638769",
        "about_us": "stablished in 1977, we have built a strong reputation for our extensive turbocharger expertise, offering full service from scheduled overhauls to in-situ emergency repairs.\n\nWe take pride in our constant pursuit of operational capabilities that are in advance of market needs, substantiating our value configuration of innovative reclamation solutions as well as technical and spares support for every delivery to be in full and on time."
    },
    {
        "name": "Wenzel Marine GmbH & Co. KG",
        "email": "mail@wenzelmarine.com",
        "phone": "49 171 8375242,  +49 174 9944450, +49 171 8375242",
        "website": "wenzelmarine.com",
        "location": "Germany",
        "address": "Rodendamm 25\nD-28816 Stuhr-Brinkum Germany",
        "about_us": "Owner-operated business Wenzel Marine has been specialising in this area since 1991 and is able to process more than 70% of its customer orders from its on-site warehouse in Brinkum, near Bremen. This crucial advantage doesn’t just save on valuable time – it furthermore places Wenzel Marine several steps ahead of its competition. Our offensive pricing policy means favourable conditions for our customers all over the world."
    },
    {
        "name": "AHF Industries Singapor",
        "email": "ales@ahfindustries.com",
        "phone": "+65 6748 8108",
        "website": "ahfindustries.com",
        "location": "Singapor",
        "address": "2 Kallang Pudding Road #07-12, #06-05/06 ,MacTech Building Singapore 349307",
        "about_us": "Since 1987, AHF Industries has gained recognition as an established agent/ distributor of industrial & commercial suppliers of valves, valve automations & control solutions and is currently one of the market leader in Singapore.\n\nAHF Industries is a full service multi-discipline organization for valves supplies, valve automation and control solution for Oil & Gas, Marine, Petrochemical and Pharmaceutical Industries. Most of our valves manufacturers have obtained ISO 9000/1, ISO 200, ISO 14001, API, TUV, ABS, LLOYD, BVQI, RWTUV, CE, KSB, VERITAS, NKK, UL/FM and etc certifications which complied to International Standard.\n\nOur Vision is to become world-class company in the Asia-Pacific Region for valves supplies, valve automation and control solution.\n\nOur mission is our commitment to provide excellent products and services to our customers in Asia-Pacific Region with Great Trust and Satisfaction in term of our services and products reliabilities."
    },
    {
        "name": "AMOT UK",
        "email": "info@amot.com",
        "phone": " +44 (0) 1284 715739",
        "website": "amot.com",
        "location": "United Kingdom",
        "address": "Western Way\nBury St Edmunds IP33 3SZ United Kingdom",
        "about_us": "Already a respected name in temperature control valves since 1948, AMOT began producing diesel engine shutdown systems in the 1980s for engine manufacturers in response to new safety demands for offshore engines in the Gulf of Mexico. Following the acquisitions of the most well-known brands in diesel engine safety, AMOT is now unrivalled in its selection of diesel engine safety systems, temperature control valves, replacement parts, and accessories. With sales, manufacturing, and customer support teams located around the globe, AMOT continues to be the answer for engineered control and safety systems."
    },
    {
        "name": "Advance Marine Solutions Ltd",
        "email": "info@amarsolutions.gr",
        "phone": "+30 210 9627185",
        "website": "amarsolutions.gr",
        "location": " Greece",
        "address": "Delfon 52, Glyfada 16561\nAthens, Greece",
        "about_us": "We are a well established and flexible company which operates since 2006 in the marine industry.\n\nThe products that we supply, are focused on minimizing engine faults, ensure the vessels safety while protecting the environment.\n\nThe markets in which we opperate are Greece, Middle East and North Europe.\nOur customer service specialists are focused on responding to customer needs and receive regular training on new technologies apllied to our products.\n\nThe members of our technical staff have decades of laboratory and field experience and actively participate in professional and standards development organizations.\n\nOperations in A.M.S. administrative and distribution facilities take advantage of the latest advances in technology, in order to achieve better speed at processing and delivering your orders."
    },
    {
        "name": "M.G.CRYSSAFIDIS ",
        "email": "sales@chryssafidis.gr",
        "phone": "+30 210 4836315 - 20",
        "website": "chryssafidis.gr",
        "location": "Greece",
        "address": "3, Agriniou Str. Tavros\nAthens, Greece 177 78",
        "about_us": "Founded in 1882, the CHRYSSAFIDIS Group of Companies is the oldest and one of the largest suppliers of plumbing and industrial goods in Southeastern Europe. Throughout its history, it has been recognized by its customers for the quality and reliability of its products and services. CHRYSSAFIDIS is certified by TÜV NORD of Germany according to ISO 9001:2015. CHRYSSAFIDIS has received many awards for quality, including the Athens Chamber of Industry and Commerce Prize of Excellence and Tradition which was bestowed by the Greek Minister of Finance.\n\nDue to its large range of products, CHRYSSAFIDIS can offer its customers one-stop shopping and complete solutions which are tailored to client needs. CHRYSSAFIDIS supplies industry, construction companies, shipping, trade and commercial entities with equipment used in water, steam, food, pharmaceutical, gas and petrochemical networks. It supplies pipes (API, EN, DIN, SMS, 316L, 304, PP-RCT Faser etc), fittings, valves, pressure reducers / safety valves, ball valves, steam traps, control equipment, flanges, insulation and other products, made of cast iron, steel, stainless steel, bronze and plastic."
    },
    {
        "name": "Philippopoulos Energy S.A.",
        "email": "",
        "phone": "+302105789640",
        "website": "philippopoulos.gr",
        "location": " Greece",
        "address": "24, Kallidromou str,, Peristeri, Greece, 12133",
        "about_us": "Philippopoulos s.a. is a technical-commercial company, which provides a comprehensive range of high-quality valves, instruments, auxiliary components, and complete systems, for a wide range of fluid management applications and energy transmission and storage networks in the industrial sector.\n\nOur products are aimed at the chemical and petrochemical industry, power generation units, as well as all industrial processing units, such as the pharmaceutical industry, the food and beverage industry, the textile industry, the paper industry, the steel, aluminum, and other mineral products industry, etc."
    },
    {
        "name": "Bakelas S.A",
        "email": "info@sbakelas.gr",
        "phone": "210 9029669, 210 9022298",
        "website": "sbakelas.gr",
        "location": "Greece",
        "address": "17, P. Tsaldari str, Kallithea Athens, Greece, 17676",
        "about_us": "Our company, Bakelas S.A., was established in 1992, and within a short period of time, became one the largest and most comprehensive supplier of mechanical industrial – plumbing equipment in Greece.\n\nOur complete range of products includes equipment for steam, water, thermal oil, liquid and gas systems, as well as complete systems of electronic controls and automation, and energy saving.\nOur technical know-how, our immediate response, our pre-sales and after-sales services together with the experience of our engineers, guarantee excellent levels of customer satisfaction, by ensuring reliable and responsible solutions."
    },
    {
        "name": "DBV VALVE CO.,LTD",
        "email": "info@dbv-armaturen.com",
        "phone": "+0086-0577-67387723",
        "website": "dbv-armaturen.com",
        "location": "China",
        "address": "No.96 Fanhua East Road, OuBei, WenZhou, Zhejiang, China, 325102",
        "about_us": "DBV is the right direct valves manufacturer. As one of the biggest valve factory in china, we make ball valves, butterfly valves, gate valves, globe valves and check valves."
    },
    {
        "name": "YAAO Valve Co., Ltd.",
        "email": "sales@yaaovalve.com",
        "phone": "+86-577-57687955",
        "website": "yaaovalve.com",
        "location": " China",
        "address": "Sanqiao Industrial Zone, Oubei Sub-district, Yongjia County, Wenzhou City, Zhejiang Province, China",
        "about_us": "Founded in 1991, Yaao Valve is dedicated to be specialized in producing forged steel valves from the very beginning. Our product line includes: Gate, Check, Globe, Ball Valve and Valve Actuator & Switch with unique design features. Over the years, Yaao Valve has become one of the leading manufacturers of forged steel valve and get solid reputation for our reliable quality and competitive price in this area. Our products are widely used in various market, such as Chemical, Petro Chemical, Oil & Natural Gas, Power, Refineries, Industrial Plats and many other industries."
    },
    {
        "name": "China Valve Industry Co.,Ltd",
        "email": "sales@mfrsvalve.com",
        "phone": "86 592 5819200",
        "website": "chinavalvesflange.com",
        "location": " China",
        "address": "No. 879, Jiahe Road, Xiamen, Fujian, P. R. China.",
        "about_us": "China Valve Industry Co.,Ltd  has been established in 1989, covering an area of more than 200 acres, factory building area of 5300 square meters, where there are about 500 existing staff and 30 technicians.China Valve Industry Co.,Ltd is a professional factory that produces a variety of valves available in forged steel,cast steel,cast iron and others, which enjoys high reputation and influence among Fujian valve industries and owns valve technical center as well as technical research team."
    },
    {
        "name": "KORVAL Co., Ltd.",
        "email": "sales@korval.co.kr , spare@korval.co.kr",
        "phone": "+82-51-790 9700",
        "website": "korval.co.kr",
        "location": " Korea",
        "address": "92 Dasanro, Saha-gu, Busan, Korea",
        "about_us": "KORVAL is a control & safety valve manufacture company established in April 1993, aiming for a international valve provider. It is based on innovative valve technologies, know-hows, and valve specialist with skills and experience origianted from its 25 years worldwide valve supply.\n\nThe wide range of product model enable KORVAL to propose and supply integrated project packages in various industries such as Shipbuilding, Marine Engine, LNG service, Offshore, Onshore and Nuclear."
    },
    {
        "name": "Valveco -the valve company- B.V.",
        "email": "sales@valveco.com  ",
        "phone": "+31 (0)88 884 00 00",
        "website": "valveco.com",
        "location": "Netherlands",
        "address": "Deventerseweg 68\n2994 LD, Barendrecht, the Netherlands",
        "about_us": "Our customers are international operating ship owners, superyachts, shipyards, offshore companies, ship chandlers, local and foreign piping & construction, maritime and trading companies.\n\nWhile Valveco’s Dutch headquarters provides the central sales and stock, our extensive logistics network includes branches in Portugal, Spain, Poland and the United States. If desired, our technical service team can perform inspection, testing and repair on-site.\n\nValveco also has an in-house workshop which repairs, overhauls, modifies and tests valves according to our customers’ requirements in the presence of all classification societies. This assures high quality and increases the life span of your valve, reduces the investment and shortens the delivery time.\n\nWe are an energetic company where quality is not only a condition, but also our highest goal. We achieve this goal by investing in people and technology, through international expansion and by broadening our activities."
    },
    {
        "name": "Lokit Polymer Pte Ltd",
        "email": "lokitpolymer@lokit.com.sg",
        "phone": "(65) 6744 6969",
        "website": "lokit.com",
        "location": "Singapore",
        "address": "37 Kim Chuan Dr, Singapore 537089",
        "about_us": "Lokit Polymer Pte Ltd is an ISO-9001 and BizSAFE certified global supplier for rubber products and services serving the Oil & Gas, Maritime & Offshore and Construction markets.\nWith two (2) strategically located manufacturing facilities in Singapore and Malaysia, customers have been counting on us for product availability, speed of service and technical expertise since 1977.\n\nOur extensive in-stock selection includes a broad range of seat rings for various types of Japanese, European and Korean butterfly valves. We also offer rubber gaskets for pipe couplings and tank domes, hatch-cover rubber packings, tanklid packings in addition to specialty products such as cargo, IG, Ballast seat rings for many FPSO, FSO and Bulker conversion projects. We also have an established track record in fabricating high-pressure OEM seals for the Oil & Gas sector."
    },
    {
        "name": "MMC International Corporation",
        "email": "info@mmcintl.com",
        "phone": "516-239-7339 \n800-645-7339 ",
        "website": "mmcintl.com",
        "location": "United States",
        "address": "60 Inip Drive Inwood, New York, United States",
        "about_us": "The enterprise that became MMC started in the early 1940s as the Marine Plastics Corporation, making deck surfacing for tankers and military vessels. After the close of World War II, the name was changed to the Marine Moisture Control Company to reflect the firm’s rapid expansion as a manufacturer of equipment for the removal of moisture from shipboard machinery and cargo spaces.\n\nOver the next several decades, MMC devices–such as its corrosion-preventing gear case dehydrators–became standard components throughout the world’s fleets of tankers.\n\nThe MMC product line continued to expand with lube oil clarifier coalescers, hydraulic valve systems, draft-indicating and tank-gauging systems, cargo-handling hose couplings, and other crucial items required by petroleum and chemical transport vessels."
    },
    {
        "name": "Pres-Vac Engineering A/S",
        "email": "presvac@pres-vac.com",
        "phone": "+45 48 17 40 55",
        "website": "presvac.gomaritimegroup.com",
        "location": "Denmark",
        "address": "Svanevang 3-5\n3450 Allerød\nDenmark",
        "about_us": "Pres-Vac Engineering was founded in 1952, and started with the invention of the first valve of its kind on the market, revolutionising the tanker shipping industry. This 70-year history ensured our providing of excellent valves and venting equipment and engineering advice. In 1966, Pres-Vac Headquarters and production moved to Allerød where production still happens today, and would eventually provide the headquarter base of G&O Maritime group. We are now part of G&O Maritime Group since 2016, and with this rich pedigree supporting us, we are proud to be the world’s leading supplier of valves and venting equipment."
    },
    {
        "name": "Valtorc International",
        "email": "SALES@VALTORC.COM\n\n",
        "phone": "1-866-825-8672",
        "website": "valtorc.com",
        "location": "United States",
        "address": "3105 Carter Circle\nKennesaw, GA 30152 United States",
        "about_us": "Valtorc International is a major supplier in the industrial control and valve market worldwide. We have a broad product line Valves and Valve automation products, to meet demanding customer requirements. Our products in this diverse market provide another example of our customer-driven, problem-solving capabilities.\n\nOur professional staff is ready to help customers with products that work best for their unique applications and quick shipment. Following up at any time and guaranteed applications are inherent in our legendary customer service."
    },
    {
        "name": "A.P. Marine Parts, Inc.",
        "email": "APMOfficeHead@gmail.com , tlangaster@apmarineparts.com",
        "phone": " (30) 210 81 32 860",
        "website": "apmarine.com",
        "location": " Greece",
        "address": "29, Alsous, Athens, Greece, 166 75",
        "about_us": "is a diversified marine supply organization which was born from the union of different companies operating in the same field.\n\nOur objective is to offer customers a high efficient service working with readiness, flexibility, punctuality and clearness at competitive prices.\n\nOur size and volume purchasing enable us to provide all variety of items and services at the most competitive prices available.\n\nWe operate in all US Gulf area with our own trucks and personnel, thus assuring to our customers total assistance.\nFurthermore our 70,000-ft² stores area guaranties the promptness of our activities and services."
    },
    {
        "name": "",
        "email": "info@pronoia.gr",
        "phone": "+30 210 57 20 762",
        "website": "pronoia.gr",
        "location": "Greece",
        "address": "48 Lysia street, Peristeri, 12132, Athens, Greece",
        "about_us": "With more than 80 years’ tradition in the quality fire protection sector, PRONOIA maintains the mentality of a youthful company at the cutting edge of technological evolution, whilst taking an agile approach to dealing with the challenges of the world market."
    },
    {
        "name": "Kashiwa Tech Co., Ltd.",
        "email": " sales@kashiwa-tech.co.jp",
        "phone": "81-3-5449-2431",
        "website": "kashiwa-tech.co.jp",
        "location": "Japan",
        "address": "4-5-4, Takanawa Minato-ku, Tokyo, Japan, 108-0074",
        "about_us": "Kashiwa Tech Co., Ltd., founded in 1947, was originated from Yamashita Steamship (later became Yamashita Shin-Nihon Steamship Co., Ltd. and then Navix Line, finally merged into Mitsui O.S.K. Lines) established by my great-grandfather, Kamesaburo Yamashita, in 1911.\nWe started our business with sales of fire extinguishers, and have expanded it to the manufacture of marine fire-fighting and hazard prevention systems, with a fervent desire to ensure marine safety and make a difference in the world.\nThe shipping industry has gone through constant changes for these decades, is still undergoing and will do in the future. But we take it not only as a challenge to ride out but also as a good opportunity to improve and change ourselves for a better organization that can create new values.\nWe are determined to keep advancing our creativity and technology so that we can offer our customers reliable products and satisfactory services."
    },
    {
        "name": "safetec Brandes und Niehoff GmbH",
        "email": "mail@safetec-online.de",
        "phone": "+49 - 4136 - 68590 - 10",
        "website": "safetec-online.com",
        "location": "Germany",
        "address": "Kringelsburg 2a\n21379 Scharnebeck Germany",
        "about_us": "safetec Brandes und Niehoff GmbH was founded in 1995 by\nDirk Niehoff and Klaus Brandes. Both partners had experience for several years with design, development and installation of CO2 fire extinguishing systems and cargo hold smoke detection systems.\n\nThe coming-up of modern micro controller technology was a challenge for safetec to develop a new concept for cargo hold smoke detection systems which should ensure high reliability, easy ans space saving installation in conjunction wih competitive prices."
    },
    {
        "name": "Consilium Safety Group",
        "email": "",
        "phone": "+46-31-710 77 00",
        "website": "consiliumsafety.com",
        "location": "Sweden",
        "address": "P.O. Box 8763, SE-402 76 Gothenburg, Sweden\nVisiting: Salsmästaregatan 21",
        "about_us": "Consilium has an installed base of 75,000 fire and gas detection systems in the marine, transport, energy and building sectors. Our journey began in 1912, and since then we have been driven by innovation. In 1959 and 1967 we introduced our gas and fire detection systems, which have become important milestones."
    },
    {
        "name": "Prime Products Ltd ",
        "email": "info@primeltd.com",
        "phone": " +30 210 4819800 ",
        "website": "primeltd.gr",
        "location": "Greece ",
        "address": "90 D. Moutsopoulou Str. Piraeus 185 41, Greece ",
        "about_us": "Prime Products Ltd is a Greek company established in 2006 specializing in gas detection products and services for the maritime industry. Run by a family with a century-old history in the business world, Prime Products has managed to develop a global network and acquire a distinct place in the market, rooted in responsibility, reliability, and efficiency. \n\nOur experience in the maritime sector has created a business tradition characterized by specialization and dedication. Always focused on safety, our work has developed into a market-defining force with a vast and satisfied clientele.\n\nOur team’s deep knowledge and attention to detail guarantee an efficient and flexible way of attending to any emerging challenge. "
    },
    {
        "name": "Autronica Fire and Security AS",
        "email": "",
        "phone": "+47 90 90 55 00",
        "website": "autronicafire.no",
        "location": "Norway",
        "address": "Bromstadvegen 59,\nNO-7047 Trondheim\nNorway",
        "about_us": "Autronica Fire and Security offers a comprehensive, high-quality range of products and services within our field and implements customer-oriented, efficient solutions. Our systems are based on the latest technologies and are founded on a broad basis of knowledge and experience."
    },
    {
        "name": "ELCETERA",
        "email": "info@etcetera.gr, marketing@etcetera.gr",
        "phone": "210 6620130, 210 6626573",
        "website": "etcetera.gr",
        "location": "Greece",
        "address": "11 Sourlatzi, Athens, Koropi, Greece, 194 00",
        "about_us": "Welcome to our company for more than fifteen years at the top of the Greek market in terms of the detection of toxic and explosive gases and that the protection of workers."
    },
    {
        "name": "Diakatos George",
        "email": "info@diakatos.gr",
        "phone": "+30 210 4622222",
        "website": "diakatos.gr",
        "location": "Greece",
        "address": "Address: Mesologgiou 53, Peiraias, Greece",
        "about_us": "The GEORGE K. DIAKATOS is a private enterprise founded in 1989 by George Diakato (trained in America and the Air Force - Chairman of the Panhellenic Union Fire - President of the Association POSEIDON) boasts a long service inspections and repair of inflatable rescue rafts (liferafts) and inspection and replenishment of extinguishers (portable and wheeled) as well as in automatic CO2 systems, and FM200."
    },
    {
        "name": "Eurosafe",
        "email": "",
        "phone": "210 5579260",
        "website": "eurosafe.gr",
        "location": "Greece",
        "address": "AGION ANARGIRON STR, ASPROPYRGOS, 19300, ATTICA, GREECE",
        "about_us": "Eurosafe is a modern company specializing in the installation,maintenance and inspection of fire fighting equipment and life saving appliances ashore and offshore. Its products and services serve all potentials needs and  maritime safety standards. Aftter all the need for prevention and protection and its coverage is given and enforced with the appropriate means in each case."
    },
    {
        "name": "Discovery Marine Ltd",
        "email": " info@discovery-marine.com",
        "phone": "+30 210 724 2700, +30 6977 239954",
        "website": "discovery-marine.com",
        "location": "Greece",
        "address": "89 Ymittou & Almiridos Str.\n18540 Piraeus\nHellas, Greece",
        "about_us": "Discovery Marine Ltd is an ISO 9001:2008 certified company established in 1997 by its managing director Mr. Nicholas Papachatzis and is involved with Fire and Safety issues on-board ships (and not only), with many years of international experience and a strong belief that “Quality Wins“.\n\nThe company is involved with attending to required by IMO/SOLAS inspections and their supplies and equipment worldwide by attending on voyage surveys and at shipyards also as required by clients.\n\nWe work closely with Classification Societies and have achieved all main required certifications and approvals for performance of services both on products and our staff, including maintaining and updating training records for them."
    },
    {
        "name": "LALIZAS",
        "email": "",
        "phone": " +30 210 42 26 274",
        "website": "lalizas.com",
        "location": "Greece",
        "address": "3 Gounari str.,\nPiraeus, 18531,\nGreece",
        "about_us": "LALIZAS, is a family owned company, whose vision is to produce high quality products that ensure safety at sea, and distribute them in international markets through its well‐established distribution network. Τhe genuine care for our customers and the indispensable input of our employees, who we consider #thelalizasforce, has resulted in the company's consistent growth and will continue to contribute positively to the continuous development of LALIZAS."
    },
    {
        "name": "EFODIASTIKI S.A ",
        "email": " info@efodiastiki.gr",
        "phone": "(+30)  210 4637120 - 121",
        "website": "efodiastiki.gr",
        "location": "Greece",
        "address": "49 Dogani Str - 18546 Piraeus Greece",
        "about_us": "FODIASTIKI SA was established in 1985 and is located in the Port of Piraeus, one of the largest ports in the world.\n\nWe are Members of the International Ship Suppliers Association (ISSA) since 1990.\n\nIn all the years of our continuous operation we have been offering quality products, representing in Greece some of the leading manufacturers of industrial equipment and maintenance products with applications both in the Marine and Industrial sector.\n\nAs a result of our quality services, our operation processes were certified with BUREAU VERITAS QUALITY INTERNATIONAL EN ISO 9002-1994 in 1999 and re-certified with ISO 9001-2000 in 2002.\n\nThe experienced and qualified staff, the well organized warehouses, our privately owned fleet of vehicles, our competitive prices combined with the high quality products, enable us to deliver   24-7 to any port in the world, thus guaranteeing the fulfillment of the customer’s needs."
    },
    {
        "name": "Martek Marine Ltd",
        "email": "info@martek-marine.com",
        "phone": "+44(0)1709 599 222",
        "website": "martek-marine.com",
        "location": "United Kingdom",
        "address": "Adwick Park\nManvers\nSwinton Rotherham S63 5AB United Kingdom",
        "about_us": "Today, we employ more than 60 highly valued staff, across our offices in the UK and Singapore, and have a full suite of products to our name that tackle a wide variety of your crew welfare concerns."
    },
    {
        "name": "Wilhelmsen Ships Service AS",
        "email": "wss.info@wilhelmsen.com",
        "phone": " (+47) 67 58 40 00",
        "website": "wilhelmsen.com",
        "location": "Norway",
        "address": "Strandveien 20 NO-1366 , Lysaker, Norway",
        "about_us": "Founded in Norway in 1861, Wilhelmsen is now a comprehensive global maritime group providing essential products and services to the merchant fleet, along with supplying crew and technical management to the largest and most complex vessels ever to sail. Committed to shaping the maritime industry, we also seek to develop new opportunities and collaborations in renewables, zero-emission shipping, and marine digitalization. Supporting a diverse and inclusive workplace, with thousands of colleagues across more than 60 countries, we take innovation, sustainability and unparalleled customer experiences one step further."
    },
    {
        "name": "Kloska Group",
        "email": "",
        "phone": " +49(0)421 - 61802 19",
        "website": "kloska.com",
        "location": "",
        "address": "",
        "about_us": "The KLOSKA group was established in 1981 in Bremen by Uwe Kloska as a technical ship chandler. He still runs the group together with his daughter Nadine.\nWe are a family-run business with a strong focus on tradition and forward thinking. Honesty, reliability, trust and respect characterize the values of our corporate culture. Lean management structures and fast decision processes determine our every day business.\n\nWe round off our standard services with a large number of attractive specialized services. At our facilities we keep approximately 130.000 different products and items on stock.\n\nOur standard service includes delivery on short notice, 24-hours service and just-in-time delivery as well as a professional, individual and personal service on site. It is of most importance to us to establish a long lasting customer relationship on a fair and solid basis."
    },
    {
        "name": "STOP AEBE",
        "email": "info@stop.gr",
        "phone": "(0030) 210 4626800",
        "website": "stop.gr",
        "location": "Greece",
        "address": "Anapafseos 2-4\n18546, Piraeus, Greece",
        "about_us": "STOP was established in Piraeus in 1978. It is a 100% Greek organization specializing in Personal Protective Equipment – production and distribution. In STOP we believe safety is culture, not obligation. Learn more about our culture"
    },
    {
        "name": "BAS",
        "email": "sales@bas.gr",
        "phone": "210 5727504",
        "website": "bas.gr",
        "location": "Greece",
        "address": "Arcadia 8 & St. Paul, Athens 121 32, Greece",
        "about_us": "The BAS is a modern Greek company for the production and marketing of maritime species, accessory vessels and survival craft."
    },
    {
        "name": "VANOS ",
        "email": "info@vanos.gr, sales@vanos.gr, supplies@vanos.gr",
        "phone": "+30 210 4278700",
        "website": "vanos.gr",
        "location": "Greece",
        "address": "96, Dim. Moutsopoulou & Serifou str.185 41, Piraeus – Greece",
        "about_us": "Established in 1929, VANOS has been dealing with the distribution of deck, engine & cabin stores, industrial products and marine coatings, therefore Marine Dpt. consists of an integral part of our legacy. Ever since, its portfolio has been broadened covering a full spectrum of shipping and heavy industry, maintaining a stock of the most reputed and renowned Brands across the globe.\nOne of VANOS S.A.’s competitive advantages is maintaining a steady warehouse stock of 80% among the usual trades, amounting over 177.000 single item codes, monitored and supported by our highly skilled staff and an advanced Warehouse Management System, delivering immediacy across the supply chain, as well as full traceability.\nIt should be highlighted that Provisions & Bonded Stores department, established since 2009, is certified according to ISO22000 Food Safety Management System, ensuring safe management of food products (dry-fresh-frozen temperature): from the appropriate storage until the delivery to the designated place, through our privately owned refrigerator trucks and our adequately trained & certified representatives."
    },
    {
        "name": "ZAK SHIPSTORES",
        "email": "info@zakshipstores.gr",
        "phone": "+30 2310 556 251, +30 2310 593 586, +30 6936 602 006",
        "website": "zakshipstores.gr",
        "location": "Greece",
        "address": "Inside The Port of Thessaloniki (Gate 11)\nGEMH number 58801304000\n54110 Thessaloniki Greece\nPO BOX 10016",
        "about_us": "ZAK SHIPSTORES offers a Ships Supply service in the ports of Northern Greece. These services include purchasing, consolidation and distribution of Provisions (fresh, frozen and dry) - departments specialized in food supply to Vessels, Cabins, Stationary Stores, Deck, Engine and Safety Store. Many specialized products are also available to satisfy crews of differing nationalities. Our delivery fleet is fully equipped to ensure that the vessel will receive fresh and first rate quality products. Fruit, vegetables and dairy products are purchased on a daily basis. We are able to deliver to Cruise, Cargo, Military, Fishing and Offshore  Vessels. Our unique feature is our availability of customer service."
    },
    {
        "name": "Kidde Fire Protection",
        "email": "",
        "phone": "+44 (0) 1494 480 410",
        "website": "kidde.com",
        "location": "United Kingdom",
        "address": "1st Floor, Stokenchurch House, Oxford Road , Stokenchurch, Buckinghamshire, HP14 3SX , United Kingdom",
        "about_us": "Kidde Fire Protection is renowned as a world leader of gaseous fire protection systems and has been at the forefront in the design and development of fire suppression products for over one hundred years.\n\n"
    },
    {
        "name": " BG SAFE S.r.l. ",
        "email": "baronetto@lifeboatservices.com",
        "phone": "+39 0586 839588",
        "website": "lifeboatservices.com",
        "location": " ITALIA",
        "address": "Via L.A. Muratori, 19\n57128 Livorno – ITALIA\nvat: IT01547510493",
        "about_us": "BGSafe S.r.l. is a 10 years old company born from the spirit of initiative of two partners, who decide to set up a company specialized in survey, maintenance, repairs, sales, and test life saving and lifting appliances, using their past experiences.\n\nA good reputation, introduction in the shipping market, especially in safety field, together with a knowledge of technical manager needs, and a deep international approach, is mixed with excellent technical skills good knowledge of electro mechanics and experience on board , made the company grow up today."
    },
    {
        "name": "Marilot Electronics LTD",
        "email": "info@marilot.gr",
        "phone": "+30 210-4537374, +30 211-4060358",
        "website": "marilot.gr",
        "location": "Greece",
        "address": "15, Sachtouri Str.\nGR 18536 -Piraeus, Greece",
        "about_us": "Marilot Electronics is a commercial and technical company established in 2013 in Piraeus; and is expanding since then in the maritime market. The core activities of our company incorporate:\n\nthe design and implementation of turn-key navigation and communication solutions and the provision of a full range of products, in conformance with all the latest international regulations and quality standards\nthe provision of high quality services on sales, maintenance and support issues, through highly trained and experienced technical personnel"
    },
    {
        "name": "ceanSat",
        "email": "info@oceansat.com",
        "phone": "+31 85 040 3600",
        "website": "oceansat.com",
        "location": "The Netherlands",
        "address": "Larikslaan 32\n3921 ZA Woudenberg, The Netherlands",
        "about_us": "OceanSat is a Dutch based company working in the maritime IT & communications industry in the OffShore, Merchant Fishery and Yachting market. Providing customers with the right IT & Communication solutions, to create happy vessels!"
    },
    {
        "name": "SELMA",
        "email": "info@selmacontrol.com",
        "phone": "+30 210 463 5951\n+30 210 462 0167",
        "website": "selmacontrol.com",
        "location": "Greece",
        "address": "122 Kallikratida Str.,\n18546 Piraeus,\nGreece",
        "about_us": "SELMA offers a wide range of type approved systems designed, developed and integrated using industrial, heavy duty, state of the art marine technology.\n\n"
    },
    {
        "name": "NOVA ELECTRONICS S.A",
        "email": "info@novaelectronics.gr , sales@novaelectronics.gr",
        "phone": "+30-2104121578",
        "website": "novaelectronics.gr",
        "location": "Greece",
        "address": "5 Aitolikou, Kastoros70, Piraeus, Greece",
        "about_us": "Electronic electric equipment.Sales installation and service of marine communication and navigation equipment"
    },
    {
        "name": "MARAC ELECTRONICS S.A",
        "email": "",
        "phone": "+30210 4314361",
        "website": "marac.gr",
        "location": "Greece",
        "address": "55, Dimokratias Ave.\nGR-188 63 Perama Piraeus - Hellas, Greece",
        "about_us": "MARAC ELECTRONICS SA covers a wide range of activities in the Telecommunications, Information Technology, Environment, Marine, Energy and Special Applications areas. For this purpose our company chooses per case well known strategic partners from the global market while also designs, manufactures and provides products developed in its own laboratories.\nOur company provides full technical assistance to its customer that covers feasibility studies as well as specialized studies conduction, systems installation and maintenance, users training, etc. while at the same time MARAC consists one of the few vertical companies in Greece and Southern-Eastern Europe.\n"
    },
    {
        "name": "Entel UK Limited",
        "email": "info@entel.co.uk",
        "phone": "+44 (0)20 8236 0032",
        "website": "entel.co.uk",
        "location": "United Kingdom",
        "address": "320 Centennial Avenue\nCentennial Park\nElstree\nBorehamwood\nHertfordshire\nWD6 3TJ\nUnited Kingdom",
        "about_us": "Established in 1995, the Entel Group is a fully independent radio communications company that operates design and manufacturing divisions and distributes to a global market. Ranked among the leading industry brands, Entel brings exacting standards of innovation, quality and excellence to its business-critical radio communications equipment so that users can communicate effectively in even the most hostile environments."
    },
    {
        "name": "FURUNO HELLAS S.A.",
        "email": "",
        "phone": "(+30) 210 400 4426",
        "website": "furuno.gr",
        "location": " Greece",
        "address": "10 Thetidos str, GR 16675, Glyfada, Greece",
        "about_us": "Being a trusted maker in Greek Market for the last 20 years and more, FURUNO ELECTRIC Co. LTD. founded in 1948 in Japan, has been contributing to global maritime community by providing reliable marine equipment, systems and service for ensuring the safe and efficient navigation, serving more than 80 countries through the network of 33 subsidiaries and 85 national distributors at almost every port of the world.\n\nEstablished in 2009, FURUNO HELLAS S.A., being a 100% Subsidiary of FURUNO for Sales & Service and recognizing the importance of the Greek maritime community, has been introducing innovative equipment of Deep Sea and Fishing sector (HermAce & Astrolabe), supporting Greek customers on a worldwide scale with service coordination through FURUNO worldwide services network. FURUNO HELLAS, acting as a 24/7 single point of contact, offers consulting,  troubleshooting and  service through our experienced workforce.  \n\nLeadership is a result, not only of efficient equipment proper after sales service, but also of innovative advanced technology following global trend, by inventing among others a system called HermAce, which is a unique Remote Monitoring Troubleshooting tool for preventive maintenance of FURUNO equipment."
    },
    {
        "name": "Quality Marine Services Pte Ltd",
        "email": "sales@qms.com.sg",
        "phone": "+65 62594746",
        "website": "qms.com.sg",
        "location": "Singapore",
        "address": "421 Tagore Industrial Avenue\n#02-21 Tagore 8\nSingapore 787805",
        "about_us": "Quality Marine Services Pte Ltd was founded in 1994, with 4 staff, in the servicing field of Marine Navigation and Communication Equipment. Today, we have a decent group of well qualified and experienced staff serving the marine electronics sector and offshore.\n\nWith a team of factory-trained engineers, we service various types of communication and navigation equipment including the Integrated Bridge System for one-man bridge. We also provide consultancy services to ship owners in accordance to International Maritime Organization Regulations/MODU."
    },
    {
        "name": "Navarino",
        "email": "info@navarino.gr",
        "phone": "+30 210 41 11 311",
        "website": "navarino.co.uk",
        "location": "Greece",
        "address": "3 Akti Miaouli Str.\nPiraeus 18535\nGreece",
        "about_us": "Navarino is a leading technology company offering complete solutions to the maritime sector, including hardware, software and connectivity.\n\nThe company develops cutting-edge services and innovative IT solutions to bring true value to ship operators and to create strong, long-term relationships built on a five-star customer experience."
    },
    {
        "name": "MetOcean Telematics",
        "email": "\nsales@metocean.com",
        "phone": "+1 902 468 2505",
        "website": "metocean.com",
        "location": " Canada",
        "address": "11 Thornhill Drive\nDartmouth, Nova Scotia\nB3B 1R9 Canada",
        "about_us": "MetOcean Data Systems (‘MetOcean’) was first incorporated in 1984 and grew to be known as a world leader in integrated systems used for real-time environmental monitoring. JouBeh Technologies (‘JouBeh’), established in 2008, was a leading global Iridium satellite reseller that spanned the globe with unmatched service and support."
    },
    {
        "name": "Inmarsat Global Limited ",
        "email": "",
        "phone": "",
        "website": "inmarsat.com",
        "location": "",
        "address": "",
        "about_us": "Relied on for over 40 years, our world-leading satellite networks touch every aspect of life, all over the planet, to keep communities, companies and countries connected when it matters most – even during the most turbulent times.\n\nWe’re here to keep you safe. Inmarsat was set up in 1979 by the International Maritime Organization (IMO) to develop a satellite communications network for protecting lives at sea and we are deeply proud of our safety heritage."
    },
    {
        "name": "Riverside Marine Electronics",
        "email": "sales@marineelec.com",
        "phone": "+1 786-287-6136   ",
        "website": "marineelec.com",
        "location": " United States",
        "address": "3750 NW 28 Street Unit 406\nMiami , Florida 33142  ,  United States",
        "about_us": "With over 30 years experience , Riverside Marine has been providing Sales, installation and service for GMDSS and Navigation equipment. Our Technicians are fully Factory Trained and GMDSS and FCC Licensed . We service all mayor Brands such as JRC, Raytheon Furuno, Anschutz, Sperry , Cobhan and others. Give us a Call or contact us via our contact form so we can help you on your next project or repairs. We also perform Radio Surveys and SVDR/VDR Annual APT Testing. "
    },
    {
        "name": "",
        "email": "",
        "phone": "",
        "website": "",
        "location": "",
        "address": "",
        "about_us": ""
    },
    {
        "name": "ELKIME S.A",
        "email": "elkime@elkime.com",
        "phone": "+30 210 9521 008",
        "website": "elkime.com",
        "location": " Greece",
        "address": "5, Kalimnou Str, MOSCHATO\nPIRAEU S - GREECE, 183 45",
        "about_us": "ELKIME S.A. was established in 1961. It is a Sales and Service organization covering the entire field of Marine Electronics, continuing a tradition of more than 40 years.\nELKIME S.A. is also a founding member of the \"HELLENIC ASSOCIATION OF MARINE ELECTRONICS COMPANIES\".\n\nOur Premises at PIRAEUS Area, are 700 m2 total useful area, fulfill all the necessary sections for Services, Repair, Spare parts area, Sales Dept., Stores, Administration area, Account & Financial depts. Etc."
    },
    {
        "name": "Akton d.o.o.",
        "email": "info@akton.si",
        "phone": "+386 1 2362 900",
        "website": "akton.net",
        "location": "Slovenia",
        "address": "Dunajska cesta 9, 1000 Ljubljana, Slovenia",
        "about_us": "Akton was registered in 1991 in Slovenia. With international private capital and a bold vision, the company grew from a local start-up into today’s Akton Group.\nWith its subsidiaries, the Group expanded its operations to cover five countries and became an established international provider of communication services.\nThe highly trained and motivated team now runs the most advanced network in the region. The company is privately owned,  \nwith parent company owners key decisions regarding the company decided unanimously."
    },
    {
        "name": "Cay Electronics",
        "email": "usastore@cayelectronics.com",
        "phone": "(401) 683 3520",
        "website": "cayelectronics.com",
        "location": "United States",
        "address": "Melville Marine District\nOne Maritime Drive\nPortsmouth, Rhode Island, USA",
        "about_us": "Cay Electronics is a marine electronics and electrical systems company providing equipment sales, installations, and repairs to private and commercial vessels of all sizes, power or sail, in New England, the Caribbean, and around the world.\n\nCay Electronics is an authorized dealer for all major brands of marine electronic and electrical equipment."
    },
    {
        "name": "Jason Marine Group Limited",
        "email": "service@jason.com.sg , marketing@jason.com.sg",
        "phone": " +65 6477 7700",
        "website": "jason.com.sg ",
        "location": "Singapore",
        "address": "194 Pandan Loop #06-05\nPantech Business Hub\nSingapore 128383",
        "about_us": "We are a Marine Communication Equipment and Service Provider based in Singapore serving the Asia Pacific region for over 40 years. We provide marine electronic equipment and marine communication integration solutions for offshore vessels arriving in Singapore or around the Asia region.  \n\nWe serve as a central point for supply of all modern marine electronic products and equipment for vessels and oil and gas drill ships or rigs, including the provision of engineers and technicians to repair marine communication electronics equipment onboard vessels. Our forte is specializing in supplying marine electronics equipment, repair marine electronics, servicing marine communication system and full capability of marine system integration from design, delivery to commissioning for your ship or offshore platform oil rig.  "
    },
    {
        "name": "Radiomar ",
        "email": "",
        "phone": "(21) 3993-5030",
        "website": "radiomar.com.br",
        "location": "Brazil",
        "address": "Rua Lauro Müller 116 (Rio Sul), Room 1501 – Botafogo\nCEP 22290-160 – Rio de Janeiro – RJ, Brazil",
        "about_us": "For 49 years we have offered complete support in technological solutions for critical navigation, communications, information technology and automation systems.\n\n\nWe support partners from advising on equipment selection, engineering projects, systems integration, commissioning, training, GMDSS and VDR Radio Station inspections, tracking services (Petrobras, SIMMAP and LRIT), telemetry and after-sales services through Preventive Maintenance Contracts or separate contracts."
    },
    {
        "name": "ROKURA",
        "email": "office@rokura.ro",
        "phone": "+40 21 206 81 00",
        "website": "rokura.ro",
        "location": " Romania",
        "address": "Str. Rahmaninov 46-48\nSector 2, Bucuresti\n020199 Romania",
        "about_us": "ROKURA is a dedicated communication, voice and data solutions integrator, and it has the ability to assimilate multiple communication platforms – optical fiber, radio, high voltage cable, GSM, satellite – within a comprehensive, complete and reliable solution."
    },
    {
        "name": "SATLINK",
        "email": "info@satlink.es",
        "phone": " +34 91 327 21 31",
        "website": "satlink.es",
        "location": "Spain",
        "address": "Carretera de Fuencarral Arbea Campus Empresarial – Edificio 5. Planta baja. 28108 Alcobendas – Madrid (ESPAÑA).",
        "about_us": "Satlink is a Spanish technological company focused on the development of Internet of Things (IoT) and connectivity end to end solutions. As a world leading provider of technological solutions for the fishing segment –both the industry and fisheries regulators-, Satlink helps them optimize decision-making by providing access to data for more sustainable and efficient management of ocean resources. \n\nSince its foundation in 1992, the company has maintained a strong commitment to research, innovation and development that has translated to sustained and constant growth, while keeping sustainability and ocean conservation at its core."
    },
    {
        "name": "Schuemperlin Engineering AG",
        "email": "info(at)schuemperlin.com",
        "phone": "+41 78 410 3431",
        "website": "schuemperlin.com",
        "location": "Switzerland",
        "address": "Moosburgstrasse 2\nCH-8307 EFFRETIKON\nSwitzerland",
        "about_us": "Supplier of professional telecommunication equipment and services\nDevelopment and Engineering\nEmbedded Systems\nControl command and supervision systems\nRDS-equipment\nE-mail systems (WaveMail, WaveNet"
    },
    {
        "name": "Scortel Ltd",
        "email": "office@scortel.com ",
        "phone": "+359 2 978 9590\n+359 2 879 7400\n+359 878 344 550 ,+359 887 806 701",
        "website": "scortel.com",
        "location": "Bulgaria",
        "address": "Sofia 1582, Druzhba 2\n29, Deliiska vodenitza str., 1st floor, Bulgaria",
        "about_us": "SCORTEL provides delivery of equipment and communication services, software, system integration, engineering and consultancy services for:\n\nFleet Management and GPS Fleet Tracking Systems\nMobile Satellite Communications (Inmarsat, Iridium, Thuraya, Globalstar, KVH)\nMaritime Communications and Navigation\nSystem solutions:\nMaritime Information Systems (VTMIS, FVMS)\nIntelligent Transport Systems, including: Fleet and traffic management, Ticketing and fare management, Real time passenger information, Passenger counting, Video surveillance\nMonitoring and Early Warning Systems\nProcess Control Systems\nAutomated Systems for Operational Management of Construction Works (ASOM)\nMobile video surveillance"
    },
    {
        "name": "Marlink-ITC, Inc.",
        "email": "sales.americas@marlink.com",
        "phone": " +1 310 616 5594, +1 855 769 3959",
        "website": "marlink.com",
        "location": "USA",
        "address": "3327 S Sam Houston Parkway E\nSuite 100\nHouston, TX 77047 , USA",
        "about_us": "For over 75 years, we have been the driving force in providing connectivity solutions to optimize your remote operations. Our journey has been marked by relentless innovation, expanding our footprint and quality of service, supported by strong partnerships with technology players."
    },
    {
        "name": "Icom UK Ltd",
        "email": "",
        "phone": "+44 (0)1227 741741",
        "website": "icomuk.co.uk",
        "location": "United Kingdom",
        "address": "Blacksole House\nThe Boulevard\nAltira Park\nHerne Bay\nKent\nCT6 6GZ",
        "about_us": "Originally established in 1974 as Thanet Electronics, Icom UK Ltd started as a retailer and trade distributor to the Amateur radio market.\n\nThe company has become one of the country's leading distributors of radio communications products. It has built a reputation for providing the marine, aviation, Amateur and two-way radio business markets with high-quality products and excellent service.\n\nBased in Herne Bay, Icom UK Ltd now employs 30 staff and has an established dealer network throughout the UK and the Republic of Ireland."
    },
    {
        "name": "Japan Radio Co",
        "email": "",
        "phone": "+81-3-5534-1209",
        "website": "jrc.co.jp",
        "location": " Japan",
        "address": "7-32, Tatsumi 1-chome, Koto-ku, Tokyo 135-0053, Japan",
        "about_us": "JRC contributes to the safety and security of people around the world by utilizing the technology, knowledge, and experience it has cultivated over many years in various fields of the information and communications society.\n\nMarine Systems"
    },
    {
        "name": "Comrod Communication AS",
        "email": "info@comrod.com , sales@comrod.com",
        "phone": "+47 5174 0500",
        "website": "comrod.com",
        "location": "Norway",
        "address": "Fiskaavegen 1, 4120 Tau\nNORWAY",
        "about_us": "Comrod Communication Group is an international company with development, production, sales & marketing to the defense communication and civil markets. The Comrod Communication group of companies are associated with innovative, high quality solutions and long-lasting products.\n\nThe Norwegian subsidiary, Comrod AS, is a supplier of antennas, antenna systems and power supplies, mainly for the defence market, but also for maritime and commercial applications.  Comrod France SAS is a supplier of masts and mast systems, antennas and composite industrial products.  Comrod Sweden AB (formerly WIBE Telescopic Masts) are a world leader in the design and manufacture of crank-up and motorized aluminium telescopic masts.  Comrod Inc, located in Cleveland, Ohio USA, was opened in 2010 to serve the US market. Comrod Inc has full access to the entire Comrod Group of products as well as the support of the design, engineering and manufacturing teams."
    },
    {
        "name": "Danelec Marine A/S",
        "email": "info@danelec.com , sales@danelec.com",
        "phone": "+45 4594 4300",
        "website": "danelec.com",
        "location": "Denmark",
        "address": "Hørmarken 2\n3520 Farum\nDenmark",
        "about_us": "Danelec is a leading manufacturer of Voyage Data Recorders (VDR), Shaft Power Meters (Kyma), and a supplier of cutting-edge Ship Performance Monitoring systems. Boasting decades of experience in ship data collection, our technologies are installed on over 11,000 vessels, driving operational optimization for safety, cost-effectiveness, and performance. Our dependable, economical maritime IoT infrastructure, DanelecConnect, empowers both in-house and expert partner digital solutions.\n\nOur global presence, with offices in Denmark, Norway, Greece, Germany, Poland, Singapore, South Korea and China and over 600 factory-trained personnel in 50+ countries, ensures reliable and fast support anywhere in the world."
    }
]